[
    {
        "link": "https://www.guardianlife.com/life-insurance/how-much-life-insurance-do-you-need",
        "raw_text": "How much life insurance do you need? | GuardianPlease enable JavaScript to use this pageSkip to main contentFind a dentistFind a vision providerFind a financial professionalForms and claimsContact usInsurancePlans and policiesLife insuranceDisability insuranceDental insuranceVision insuranceAccident insuranceCritical illness insuranceHospital indemnity insuranceWorkforce solutionsGroup benefitsAbsence managementPaid family & medical leaveBenefits technologyEnrollmentMental wellnessInvestmentsRetirementInvestment accountsFind a financial professionalResourcesIndividuals and familiesLearning CenterForms and claimsFind a dentistFind a vision providerFind a financial professionalLife insurance quoteDisability insurance quoteDental insurance quoteVision insurance quoteRetirement calculatorEmployers and brokersResearch and insightsReportsWebinarsJoin as a brokerFind a sales officeAbout usAbout GuardianCareersNewsroomContact usSocial responsibilityOur diverse and inclusive cultureI am...an individual or familyan employera brokera dental providera financial professionalLog inGet a quoteGot a minute?Get a quoteSelect insurance typeNeed help? Call us:(888) 482-7342How much life insurance do I need? Here are some rules of thumb.Written byGuardian Editorial TeamReviewed byGuardian Compliance TeamLife Insurance coverage is an important part of everyone’s financial plan – but not everyone needs the same life insurance coverage. Your situation, obligations, and priorities are unique to you, and the amount of life insurance you need reflects that. This article will help you better understand:Why you need life insuranceGeneral rules for determining the amount you needWhat’s the right amount of coverage for youGot a minute? Get a quote.If you are a broker looking for a quote, please connect with us here.Select oneLifeDisabilityDentalVisionRetirementAll fields are required unless marked optional.GenderSelect your genderDo you use cigarettes or e‑cigarettes?SelectAgeAnnual IncomeGet a quote All fields are required unless marked optional.GenderSelect your genderAgeOccupationSelect StateSelect your stateAnnual IncomeGet a quote All fields are required unless marked optional.First nameAge rangeSelect rangeEmailZipAdd spouse/partner(optional)Add dependents(optional)Get a quote All fields are required unless marked optional.First nameEmailZipAdd spouse/partner(optional)Add dependents(optional)Get a quote All fields are required unless marked optional.My age isI want to retire atI have this amount in qualified savingsYour qualified savings include IRAs, 401(k)s and other retirement accounts funded with pre-tax dollarsEvery year I saveGenerally this is around 10% of your annual income. A good annual savings target is 10% of your salary, gradually increasing this percentage over time.Estimated annual retirement spendingGenerally this is around 70% of your current annual incomeGet your results What is life insurance – and why you should consider itThe basic concept is simple. Life insurance is an agreement between you and an insurance company: you agree to pay premiums and in return, the company agrees to pay a specific amount to your beneficiaries – typically your family – when you pass away. It could be reassuring to know that your loved ones will have additional resources if something happens to you.“How much life insurance do I need?” really means “How big a death benefit?”Whichever kind of life insurance policy you get, you want a death benefit that’s large enough to cover the bills and expenses you won’t be able to help with if you’re gone. If you’re the primary income earner, that includes things like:Replacing income from your jobCovering your mortgage or rentPaying off debt, including credit cards and car loansSaving for collegeEven if you’re a part-time worker or stay-at-home parent, you should consider having enough insurance to pay for things like:Childcare expensesHousehold dutiesFuneral costs and/or final expensesBasically, you need enough to cover all the extra costs your family would have in your absence, especially while your kids are still at home. And generally the more dependents you have – and the younger they are – the more life insurance you may need.General rules of thumb for determining how much life insurance you needWhile you don’t know the future and you can’t foresee every possible expense your family might face in your absence, there are a few straightforward ways to start estimating your number:1. Human Life Value*Based on the value of your future earnings, a simple way to estimate this is to consider 30X your income between the ages of 18 and 40; 20X income for age 41-50; 15X income for age 51-60; and 10X income for age 61-65. After age 65, coverage is based on net worth instead of income. See below for a more detailed explanation of the philosophy behind this method and other factors that may be considered in the calculation.2. Consider multiplying your income by 10 – and add college for each childThis approach is a bit simpler but still helps plan for opportunities like college tuition for your children. How much should you add for each child? College isn’t cheap: you should account for somewhere between $100,000 and $150,000 per child. If you split the difference – and have two kids – that’s an extra $250,000.3. Consider using the DIME formulaThis method considers future expenses in addition to future earnings. DIME stands for Debt, Income, Mortgage, and Education – four significant factors to consider when making a detailed estimate of your life insurance needs:Debt: Total all your debts other than your mortgage. Car payments, credit cards, student loans – even personal obligations such as money you may have borrowed from a sibling to put a down payment on your house. On top of all that, add about $7,000 for final expenses.Income: How much do you make a year? And how many years will your family need that money? It’s a tricky question to answer, but a good place to start is determining how many years until your youngest child graduates high school. For example, if you make $50,000 and have nine years until your youngest graduates high school, put down $450,000 for income.Mortgage payments: Look at your last statement and get the payoff amount. If you have a second mortgage or HELOC (Home Equity Line of Credit) add that (if you haven’t already included it in the debt section above).Education: Anticipated college costs for each of your children. As we said before, consider planning for between $100,000 and $150,000 per child.Add those four factors all up and that’s your number. You can also adjust (i.e., subtract) for any current savings and life insurance you already carry.The Human Life Value Estimation methodSome financial professionals calculate the amount you need using the Human Life Value philosophy, which is your lifetime income potential: what you’re earning now, and what you expect to earn in the future. In its simplest form, the philosophy suggests that you multiply your income by a variable based on factors such as age, occupation, projected working years, and current benefits.As with every individual, the amount of recommended insurance you purchase depends on many factors. That’s why it’s a good idea to talk to a Financial Professional when buying life insurance.There are two basic types of life insurance – permanent (like whole life) and term.With term life policies, you pay a specific premium for a defined term (say 10 years). If you pass away during that time, a death benefit is paid to your beneficiaries – but when the term is over, you have to get new coverage or go without.Permanent life insurance policies, like whole life policies, are (generally speaking) designed to last for your entire life. Over time, a portion of your premiums can build a “cash value” to your policy.1 That cash value gives you options: you can use it to pay for premiums later on (for example, when you retire), take loans and withdrawals, or you can “surrender” (give up) the policy after your beneficiaries no longer need it and get money to help supplement your income.2We won't go into variations now, but generally speaking, life insurance premiums are higher with permanent coverage than term, because permanent life insurance policies provide more and longer-lasting benefits. However, you don’t have to choose one over the other; you can combine policy types to get the coverage amount you need. (You can read about different types of life insurance or contact a Guardian Financial Professional to learn more.)So, how much life insurance do I need?Ultimately, the answer has more to do with your feelings than anything else: The best coverage amount is the one that gives you the most reassurance that your family will be taken care of – even if you’re not around to provide that care. Remember, these general rules are just that – generalities that are not specific to you. Maybe you have other assets, such as a share in a small business. Or other obligations you’re concerned about, such as how to care for aging parents. Those specifics can get complicated pretty quickly – that’s why it’s always best to take the time to talk with someone who really understands life insurance.Who can I talk to about life insurance?That’s easy. Just contact Guardian to find a Financial Professional who will take the time to learn about your unique situation, listen to your concerns, and patiently explain the different insurance options that best fit your needs and your budget. It’s what Guardian has been doing to help protect families for more than 160 years.If you are an employee, taking advantage of your benefits at work can be a smart and cost-efficient way to get the financial protection you want for yourself and your family. Contact your HR department to review your plan details and determine how much life insurance is available to you. Your employer may provide life insurance as a benefit, or you may opt to pay for additional life insurance through payroll deductions.Suggested articlesTerm vs. whole life insurance: Which is right for you?Life insurance for people with HIVJoint life insurance for couplesCustomer serviceContact Us1-888-Guardian (1-888-482-7342)Submit a ClaimResourcesForms & ClaimsFind a dental or vision providerFind a financial professionalCareersIndustry ProfessionalsFind a Guardian benefits sales officeNew case implementation trackerLiving Balance Sheetopens in a new windowopens in a new windowopens in a new windowopens in a new windowopens in a new windowLegal InformationTerms & conditions Privacy policy DisclosuresIndividual products benefit disclosuresCybersecurityAccessibilityLanguage assistanceTelehealth NY Reg. 200Confidentiality for domestic violence victimsSEC Rule 606Amendments to broker agreementState disaster updatesMDG TX notice to providersAgreement to conduct business electronicallyReport suspected fraudDo not sell or share my personal informationGuardian® is a registered trademark of The Guardian Life Insurance Company of America, New York, NY.Copyright© 2024 The Guardian Life Insurance Company of America. All rights reserved.Disclaimer2024-171395 202603311 Some whole life polices do not have cash values in the first two years of the policy and don’t pay a dividend until the policy’s third year. Talk to your financial professional and refer to your individual whole life policy illustration for more information.2 Policy benefits are reduced by any outstanding loan or loan interest and/or withdrawals. Dividends, if any, are affected by policy loans and loan interest. Withdrawals above the cost basis may result in taxable ordinary income. If the policy lapses, or is surrendered, any outstanding loans considered gain in the policy may be subject to ordinary income taxes. If the policy is a Modified Endowment Contract (MEC), loans are treated like withdrawals, but as gain first, subject to ordinary income taxes. If the policy owner is under 59 ½, any taxable withdrawal may also be subject to a 10% federal tax penalty.3 In Growing Share of U.S. Marriages, Husbands and Wives Earn About the Same - April 20234 Why U.S. Women Now Live Almost 6 Years Longer Than Men - November 2023*The HLV Theory states that one should maintain life insurance equal to the present value of their expected future earnings. Life insurance companies place limits on life insurance available to consumers based upon this formula and have created age-based multiples of current income as a guideline. For example, a person in their 30s may be insured for around 30 times their annual income, 20 times for a person in their 40s and 10 times for people in their 50s. Age 60 and over about 1 times net worth.This article is for informational purposes only. Guardian may not offer all products discussed. Please consult with a financial professional to understand what life insurance products are available for sale.Frequently asked questions about how much life insurance you needExpand allHow do you determine how much life insurance you need?The amount of life insurance coverage you get should be enough to make you feel comfortable that your family will have the financial support they need if you’re not alive to provide for them. You can talk to a financial professional who will consider your age, income, family situation, financial obligations, and other factors to calculate a detailed estimate of that amount. You can also use this term life insurance calculator to estimate your need and get a quote, or use a rough estimation method based on your expected earnings.What is the rule of thumb on how much life insurance coverage you need?Consider getting up to 30X your income between the ages of 18 and 40; 20X income at age 41-50; 15X income at age 51-60; and 10X income for age 61-65.How much life insurance does the average person have?According to the American Council of Life Insurers, the average size of new individual life insurance policies purchased in 2019 was $178,150 in 2019.What percentage of your income should you spend on life insurance?A common rule of thumb is at least 6% of your gross income plus 1% for each dependent.How much life insurance should a stay-at-home parent get?A stay-at-home parent should get enough life insurance to cover the costs incurred by the family if anything should happen to them. For example, the surviving parent may have to hire someone to care for the home or watch any children.What are the benefits of life insurance for women?There’s reason to believe women may need more life insurance than men, not less. Women earn more than ever before, and 41% of mothers are the sole or primary breadwinners for their families.3 And on average, women live 6-8 years longer than men4, yet they typically buy less life insurance coverage and save less for retirement than their male counterparts.What is the lowest amount of insurance you can buy?Guardian has a minimum of $100,000 for a term life policy."
    },
    {
        "link": "https://doi.sc.gov/1019/Understanding-Your-Deductible",
        "raw_text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUnderstanding Your Deductible | Department of Insurance, SC - Official Website\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to Main Content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n \n \n \n\n\n    Consumers      Licensing & CE      Insurers      Captives      About Us      How Do I...?  \n\n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n \nHomeAbout UsPublic Information & MediaInsurance MattersUnderstanding Your Deductible\n\n \n\n\n\n  \n \n \n\n\n\n\n\n\n\n\n\n\n\r\n\r\nUnderstanding Your Deductible\t\t\n\n\n\n\n\n\nInsurance can be a complex subject, and one of the most confusing aspects for many consumers is the insurance deductible. Understanding what a deductible is and how it works can help consumers make informed decisions when purchasing insurance and filing claims.Simply put, a deductible is the amount of money that the insured person must pay before their insurance policy starts paying for covered expenses. For example, if you have a health insurance policy with a $1,000 deductible and you receive a medical bill for $2,000, you would be responsible for paying the first $1,000 and your insurance would cover the remaining $1,000.Deductibles can vary widely depending on the type of insurance policy, the level of coverage, and other factors. Some insurance policies, such as liability insurance, may not have a deductible at all. Others, such as homeowners or auto insurance, may have a higher deductible in exchange for lower premiums.It's important to note that deductibles only apply to covered expenses. If a particular expense is not covered by the insurance policy, it cannot be applied toward the deductible. Additionally, deductibles typically reset each policy period. For example, if you have a health insurance policy with an annual deductible of $2,000, you will need to pay that amount each year before your insurance starts covering expenses.Understanding your insurance deductible is important because it can have a significant impact on your out-of-pocket expenses. Policies with lower deductibles typically have higher premiums, meaning you'll pay more each month for your insurance coverage. However, if you have a higher deductible, you may be able to save money on your premiums but may be responsible for paying more out of pocket if you need to file a claim.When choosing an insurance policy, it's important to consider your individual circumstances and financial situation. If you have a chronic medical condition that requires frequent visits to the doctor, for example, you may want to choose a health insurance policy with a lower deductible to help manage your out-of-pocket expenses. On the other hand, if you have a healthy lifestyle and rarely need medical care, you may be able to save money by choosing a policy with a higher deductible.It's also important to understand the different types of deductibles that may be included in your insurance policy. For example, some policies may have separate deductibles for different types of coverage, such as collision and comprehensive coverage in auto insurance. Additionally, some policies may have a percentage-based deductible, which means that the deductible amount is calculated as a percentage of the total cost of the claim.Finally, it's important to know what expenses are covered by your insurance policy and what expenses are not. In some cases, you may be able to lower your out-of-pocket expenses by taking advantage of preventative care services or using in-network providers.In conclusion, understanding your insurance deductible is an important part of managing your insurance coverage and expenses. By taking the time to understand your policy and your individual circumstances, you can make informed decisions when choosing an insurance policy and filing claims. If you have questions or concerns about your insurance coverage or deductible, be sure to speak with your insurance provider or a licensed insurance agent.\n\n\n\n \n \n \n\n\n\n\n \n\n\n\n  \n \n \n\n\n \n\n\n\n \n\n\n\n\n\nSave Money, But Don't Make These Mistakes\n\n\n\n\nIs Pet Insurance Worth It?\n\n\n\n\nWhat Is Accident Insurance?\n\n\n\n\nDisaster Evacuation Plan: 5 Things\n\n\n\n\nUnderstanding Your Insurance Policy\n\n\n\n\nUnderstanding the Claim Payout Process\n\n\n\n\nSecond Home Insurance: What You Need to Know\n\n\n\n\nSummer Safety: Grill Safety and Insurance \n\n\n\n\nCOVID-19 - Unemployment and Insurance\n\n\n\n\nRecovery: What to Do Coming Out of A Storm \n\n\n\n\nPools and Insurance: What You Should Know\n\n\n\n\nTeen Drivers, Insurance and Safety\n\n\n\n\nUnderstanding Basic Homeowners Insurance \n\n\n\n\nHow To Pack An Emergency Kit\n\n\n\n\nDon't Let the Dangers of Mold Grow\n\n\n\n\nUnderstanding Health Insurance \n\n\n\n\nInsurance and Fireworks \n\n\n\n\nInsurance When Retiring Early \n\n\n\n\nCOVID-19 Scam Awareness \n\n\n\n\nCommon Life Insurance Questions\n\n\n\n\nThe Costs of Distracted Driving  \n\n\n\n\nOpen Enrollment Period \n\n\n\n\nHoliday Scams\n\n\n\n\nEnsuring a Safe Thanksgiving \n\n\n\n\nFAQ: Auto Insurance \n\n\n\n\n\nFAQs: Auto Insurance\n\n\n\n\n\n\nResiliency is a Rhyme, Not a Riddle\n\n\n\n\nSummer Claims and Tips\n\n\n\n\nFlood Insurance for Businesses\n\n\n\n\nFAQ About Flood Insurance\n\n\n\n\nHow To Use Life Insurance\n\n\n\n\nKnow the Truth About Life Insurance\n\n\n\n\nHalloween Insurance Tips! Not Tricks!\n\n\n\n\nRenewing Your Home Insurance? Here's What You Need To Know.\n\n\n\n\nInsurance for Expensive Gift Items \n\n\n\n\nFive Insurance Tips to Plan for Your New Arrival\n\n\n\n\nDon't Let Fraud Steal Your Holiday Joy\n\n\n\n\nAre You Covered for an Earthquake?\n\n\n\n\nWinter Weather: How to Protect Your Home \n\n\n\n\nWhat the No Surprises Act Means for You\n\n\n\n\nInsurance Career Spotlight: Director Ray Farmer\n\n\n\n\nInsurance Careers for New College Grads\n\n\n\n\nTricks for a Claim Free April Fool's Day\n\n\n\n\nPreparation Made Simple\n\n\n\n\nAdditional  Homeowner's Insurance Coverages\n\n\n\n\nWhat to Lookout for When Your Home Needs Repair\n\n\n\n\nHome Security Tips for When You’re Away\n\n\n\n\nHomeowner's Insurance: What You Should Know\n\n\n\n\nUnderstanding Renter's Insurance\n\n\n\n\nHow to Use the Life Insurance Policy Locator\n\n\n\n\nUnderstanding Life Insurance\n\n\n\n\nUnderstanding Your Deductible\n\n\n\n\nFlood Insurance and Excess Flood Coverage\n\n\n\n\nHow to Keep Your Flood Insurance Cost as Low as Possible\n\n\n\n\nWhat is the SCDOI and How Do We Help Consumers?\n\n\n\n\nUnderstanding the Types of Homeowner Insurance Policies for Your Dwelling\n\n\n\n\n2023 Hurricane Season is Here: Are You Prepared\n\n\n\n\n\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContact Us\n\n\n\n\n\n\n\n\nFile a Complaint\n\n\n\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLocate Insurance \n\n\n\n\n\n\n\n\nPrint License\n\n\n\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nsafe home\n\n\n\n\n\n\n\n\nFraud Division\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n  \n \n\n\n\n  \n \n\n\n\n\n\n\n\nContact Us\n\n\n\n\n\n\n\nSouth Carolina\r\nDepartment of Insurance\r\n1201 Main Street\r\nSuite 1000\r\nColumbia, SC 29201\r\nPhone:  803-737-6160\r\nEmail: info@doi.sc.gov\nClick to submit a message\r\n \n\n\n\n\n\n\n  \n \n\n\n\n  \n \n\n\n\n\n\n\n\nPopular Links\n\n\n\n\n\n\n\nAdjuster Resources\n\n\n\nProducer Resources\n\n\n\nLicense Renewal\n\n\n\nDivision Contacts\n\n\n\nBulletins & Orders\n\n\n\nOnline Services\n\n\n\nHelp Desk for Online Services\n\n\n\n\n\n\n\n\n\n/QuickLinks.aspx\n\n\n\n \n \n\n\n\n  \n \n\n\n\n\n\n\n\nHelpful Links\n\n\n\n\n\n\n\nFAQs\n\n\n\nJob Openings\n\n\n\nFile a Complaint\n\n\n\nMarket Assistance\n\n\n\nOutlook\n\n\n\nReport Agency Fraud\n\n\n\n\n\n\n\n\n\n/QuickLinks.aspx\n\n\n\n \n \n\n\n\n  \n \n\n\n\n\n\n\n\nSite Links\n\n\n\n\n\n\n\nHome\n\n\n\nPrivacy\n\n\n\nSite Map\n\n\n\nDisclaimer\n\n\n\nAccessibility\n\n\n\nReport Cyber Security Event\n\n\n\n\n\n\n\n\n\n/QuickLinks.aspx\n\n\n\n \n \n \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nGovernment Websites by CivicPlus®\n\n\n\n\n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\nLoading\n\n\n\n\n\n\n\n\n\r\n\t\t\t\tLoading\r\n\t\t\t\n\n\nDo Not Show Again\nClose\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nArrow Left\n\n\n\nArrow Right\n\n\n\n\n\n[]\n\n\n\nSlideshow Left Arrow\n\n\n\n\n\nSlideshow Right Arrow\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.scc.virginia.gov/pages/Virginia-Homeowners-Insurance-Guide",
        "raw_text": "\nVirginia SCC - Virginia Homeowners Insurance Guide\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to main content\n\n\n\n\n\n\n\n\n\n\nsearchTextMobile \n\n\n\n\n\nHome\n\n\n\r\n                                        Consumers\r\n                                        \n\n\nConsumer Home\nFile a Complaint\nInsurance\nBanks & Consumer Lenders\nInvestments\nPublic Utilities\n\n\n\n\r\n                                        Businesses\r\n                                        \n\n\nBusiness Home\nStart a New Business\nOnline Help\nUniform Commercial Code\n\n\n\n\r\n                                        Regulated Industries\r\n                                        \n\n\n\n\r\n                                                        Insurance\r\n                                                    \nAgents & Agencies\nCompanies\nExchangeAssisters\n\n\n\r\n                                                        Financial Companies\r\n                                                    \nFinancial Institutions\nSecurities & Retail Franchising\n\n\n\r\n                                                        Public Utility Companies\r\n                                                    \nUtility Regulation\nPublic Service Taxation\nUtility & Railroad Safety\nAccounting & Finance\n\n\n\n\n\r\n                                        Cases\r\n                                        \n\n\nCase Information\nSubmit Public Comments\nRules of Practice and Procedure\nParticipating in SCC Cases\nObtaining Commission Documents \nWebcasts\n\n\n\n\r\n                                        About\r\n                                        \n\n\nAbout the SCC\nCareers\nSCC News\n\n\n\nsearchText \n\n\n \n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\nInsurance\n\n\n\nProperty & Casualty\n\n\n\nVirginia Homeowners Insurance Guide\n\n\n\n\n\n\n\n\n\n\n\nProperty & Casualty\n\n\n\nVirginia Homeowners Insurance Guide\n\n\n\n\n\n\nAutomobile Insurance\n\n\n\n\nCredit Scoring for Home & Auto Insurance\n\n\n\n\nDisaster Readiness\n\n\n\n\nDisaster Strikes Insured Commercial Loss\n\n\n\n\nDisaster Strikes Insured Homeowners Loss\n\n\n\n\nForce-Placed Insurance Tips\n\n\n\n\nHomeowners/Title Insurance\n\n\n\n\nCommercial Insurance\n\n\n\n\nP&C Shopping Tips\n\n\n\n\nRenters Insurance Guide\n\n\n\n\nSeguro para Inquilinos\n\n\n\n\nSeguro para Propietarios\n\n\n\n\nTeenager's Guide to Auto Insurance\n\n\n\n\nTheft Prevention\n\n\n\n\nVirginia Auto Insurance Guide\n\n\n\n\nVirginia Commercial Insurance Guide\n\n\n\n\nVirginia Homeowners Insurance Guide\n\n\n\n\nVirginia Title Insurance Guide\n\n\n\n\n\n\n\n \nVirginia Consumer's Guide for Homeowners Insurance\nHere is a printable PDF version: ​Virginia Homeowners Insurance Consumer Guide\nThis Consumer’s Guide should be used for educational purposes only. It is not intended to be an opinion, legal or otherwise, of the State Corporation Commission on the availability of coverage under a specific insurance policy or contract, nor should it be construed as an endorsement of any product, service, person, or organization mentioned in this guide.\nTips to Remember When Buying a Policy\n\nAnswer the questions on the application completely and honestly. \nDo not sign a blank application. \nDo not pay the agent in cash. Make a check payable to the insurance company. Include the type of policy that you are paying for (auto, homeowners, etc.). \nIf you are turned down for insurance, ask for the specific reason. \nDo not buy on price alone; consider coverage and service. Select a company and agent you feel you can trust. \nDo not forget to ask about discounts for safety and security devices (burglar alarms, fire alarms, dead bolts). \nRemember to use the Homeowners Insurance Shopper’s Worksheet.\nAsk if the company gives a new home discount or multi-policy discount. \nAsk about the difference in price between a “named peril” policy and an “open perils” policy. \nAsk if the company offers credits for affiliations with certain associations/ memberships such as AARP, AAA, colleges, etc.\nMake sure your dwelling policy limits are at least 80% of the replacement cost of your home. If you do not have a recent appraisal, ask your agent to help you.\nDoes the company offer an inflation guard endorsement, and will they guarantee replacement cost coverage for your dwelling?\nDiscuss with your agent whether you should list your valuable items of personal property on a personal property schedule. Does the company offer full replacement cost coverage on your personal belongings?\nAsk about the difference in price for basic liability limits of $100,000 and a higher limit such as $300,000 or $500,000.\nCompanies are required by law to offer you water and sewer backup coverage. If your property is subject to water which backs up through the sewer or drains, make sure you get this coverage. You may have to pay extra.\nCompanies are required by law to offer you building ordinance or law coverage. This provides protection when a building damaged by a covered peril must be repaired or rebuilt in a more costly manner because the original construction does not comply with current building codes. This coverage may cost you extra.\nYour homeowners policy has some provisions that may prevent you from receiving payment for a claim even if you have paid the premium. If your home or apartment is left vacant or unoccupied, some part of your coverage may be suspended automatically. When you plan a long vacation, or when you are moving either in or out of your home, or if your home will remain vacant for any other reason, you should ask your agent or company which coverages will be suspended.\nAsk your agent if he charges additional fees over and above his commission. Agents are allowed to charge fees for services, such as photocopying, mailing, and faxing, as long as the applicant or policyholder consents in writing before the services are performed. A schedule of fees must be kept in the agent’s office. If you think your agent is charging too much, check with other agents to find out if they charge additional fees.\n\nWhy You Need Homeowners Insurance\nHomeowners insurance is something that most people do not think about until they have to use it. Although we know that there are always fires, thefts, and accidents, we tend to think, “The odds are that it will never happen to me.” Well, the odds are that it “might” happen to you. Buying homeowners insurance will not prevent fires, thefts, or some other types of loss, but it can help you recover from the financial effects of a loss that is covered by your policy. A homeowners policy can also protect you if someone is hurt or has their property damaged because of something that you do or something that you own. \nThere are different types of homeowners policies available to fit your housing situation. Whether you live on a farm, ranch, or own or rent a home, condominium, or mobile home, homeowners insurance is valuable protection that you should not be without. Your home is probably your largest and most important investment; an insurance policy will help you shield that investment. You will also need insurance to protect the lender if you have borrowed money to purchase your home.\nBasic Coverages Included in Homeowners Policies\r\nThe homeowners insurance policy is a package policy that combines more than one type of insurance coverage in a single policy. The cost of the package policy is usually cheaper than if all of the coverages were bought separately. There are four types of coverages that are contained in the homeowners policy:\r\n\r\n\nproperty damage coverage protects your home or belongings if they are damaged or destroyed by certain causes;\nliability coverage will pay if you cause another person to be injured or another person’s property to be damaged or destroyed;\nmedical payments coverage will pay for medical treatment for certain persons injured in an accident in your home and certain situations away from your home whether or not you were at fault; and\nadditional living expenses coverage will pay for you to move into a motel or apartment temporarily and will cover certain other additional living expenses when you cannot live in your home because of damage that is covered by your policy.\n\nProperty Damage Coverage\nMany years ago, most people bought insurance that would protect them only if their home was damaged by fire. Over the years, insurance companies began to offer protection for damage or loss from other causes such as windstorm, hail, vandalism, and theft. This type of homeowners insurance policy is referred to as a “named peril” policy. It covers damage to your home only if the loss is caused by something specifically listed in the policy. There is a second type of homeowners insurance policy that covers damage or loss from all causes except causes that are specifically excluded. This comprehensive policy is referred to as an “open perils” policy. Today, most insurance companies in Virginia sell both “named peril” homeowners insurance policies and “open perils” homeowners insurance policies.\nIt is important to realize that even an “open perils” policy does not cover every possible cause of loss. No homeowners insurance policy available in Virginia today covers property damage losses due to all causes. For example, no homeowners policy pays for damages caused by nuclear accidents or war, and generally, homeowners policies do not cover damages caused by flood.\nLiability Coverage\r\nUnder the liability section of your homeowners policy, your insurance company will pay if another person is injured or if another person’s belongings are damaged due to your fault. Liability coverage in a homeowners policy is not limited to accidents that occur at your home. It provides protection to you and your family wherever an accident may occur. For example, your insurance will protect you if:\r\n\r\n\nYour child injures a playmate at school.\nYou hit a golf ball through a window.\nThe letter carrier slips and falls on your front steps.\nYour friend slips and falls down the stairs in your home.\nYou accidentally break a window at a restaurant.\nYour dog bites a neighbor; however, your insurance company may exclude coverage if you have a dangerous or vicious dog that has previously bitten or attacked.\n\r\nWhen you or a member of your family are legally responsible for injury to others, the liability coverage under your homeowners policy will usually cover the damage and pay for a lawyer to defend you. There are some exceptions. The liability coverage will not protect you if you are sued as a result of something you did in your job or for something you did intentionally to harm someone else. In addition, it will not pay for liability arising out of the use of an auto, most motorized land vehicles including mopeds while in use away from the insured property, or aircraft. The basic limit for liability coverage is usually $100,000 for each occurrence. You can request higher limits which are available for an additional cost.\r\n\r\nMedical Payments Coverage\r\nMedical payments coverage is usually contained in the liability section of your homeowners policy. Unlike liability coverage which provides protection only if you are at fault, medical payments coverage pays if someone is injured in your home regardless of fault. As a minimum, this part of your policy will pay for reasonable medical expenses incurred within one year from the date of loss for a person who is injured in an accident in your home. The coverage does not apply to you and members of your household. For example, if a neighbor’s child chips a tooth while playing in your home, the medical payments portion of your homeowners policy will pay for necessary dental work. The medical payments portion of your homeowners policy will also pay if you are involved in the injury of another person away from your home in some limited circumstances. Medical payments coverage limits are generally $1,000 for each person. You may request higher limits.\r\n\r\nAdditional Living Expenses \r\nIf it is necessary for you to move into a motel or apartment temporarily because of damage caused by a peril covered by your policy, your insurance company will pay reasonable and necessary additional living expenses. It is important to note that your company will not pay for all the living expenses that you have. It will only pay those additional expenses above and beyond the normal and customary expenses. The typical policy will pay an amount up to 20% of the policy limit on your dwelling for these expenses. You should also note that if you move in temporarily with a friend or relative and do not have any extra expenses, you will not be paid any additional living expenses by your insurance company.\r\n\r\nOther Coverages\nThe homeowners policy also provides coverage for the contents of your home, other structures on your property, and trees and shrubbery. \nOther Structures on Your Property – In this part of your homeowners policy, your insurance company promises to pay if a garage, toolshed, or other building on your property but not attached to your home is damaged by a peril covered by your policy. The usual policy limit for damage to out-buildings is 10% of the policy limit on your dwelling. More coverage is available for an additional premium. This coverage may not be included in certain types of homeowners policies such as a renters policy.  \n\nPersonal Property – The amount of insurance protection for the contents of your home is usually 50% of the policy limit on your dwelling. Your homeowners policy also provides more limited coverage for personal property if it is stolen or damaged away from home, such as when you are on vacation. For example, your policy may only pay $1,000 or 10% of the total coverage on your personal property if your loss happens away from your home.\nCoverage is limited to very small amounts for certain types of property that are especially susceptible to loss, such as cash, securities, jewelry, furs, manuscripts, and stamp or coin collections. You may receive a total of only $1,500 for all furs or jewelry stolen in a single theft. A $500 limit usually applies to all securities, receivables, travel tickets, and stamp collections. Typically, there is only $100 coverage for all money, coins, or bank notes regardless of the actual amount lost. Additional amounts of insurance can be purchased, and you should ask your agent for information about the cost of scheduling these items separately. \nTrees, Shrubs, and Plants – This part of your policy provides protection against damage to greenery on your property. The coverage on trees, shrubs, and plants is provided only against certain perils. For example, damage to greenery caused by windstorm or ice is not usually covered even if you buy an “open perils” policy. The total amount that your policy will pay for trees, shrubs, and plants is usually limited to 5% of the policy limit on your dwelling with a $500 maximum per item.  \nDebris Removal – This part of your policy pays to remove debris of covered property if the damage that caused the debris is covered by your policy. Your policy will also pay to remove fallen trees that cause damage to your covered property. This coverage is included in the limit on your policy. If the loss exceeds your policy limit, the policy will pay an additional 5% for debris removal.\nTypes of Homeowners Policies\nVirginia has a regulation that provides minimum standards for coverages that must be included in all policies. While a number of companies offer basically the same coverages, many sell a policy that provides extra or broader coverages.\nThe policies have various names depending on the insurance company that sells them. Standard policies are often referred to as: \n\nHO-2 Broad Form (Named Peril) \nHO-3 Special Form \nHO-4 Renters Insurance (Contents Broad Form) \nHO-5 Comprehensive Form (HO-3 with HO-15, Special Personal Property Coverage) \nHO-6 Condominium Unit Owners \nMV Market Value or Older Homes Forms (Modified Coverage Form) \n\r\nThe type of policy you choose should depend on: \r\n\r\n\nYour type of housing; \nHow much you are willing or able to pay; and \nHow much coverage you believe is necessary for your situation.\n\nThe different types of homeowners policies vary according to the types of property they are designed to cover and the number of “perils” (causes of loss) that they cover. As mentioned earlier, policies may be of the “named peril” type, the “open perils” type, or a combination of the two types.\n“Named peril” homeowners policy forms are sold by most insurance companies in Virginia. The property damage section of these policies contains a promise to pay for losses to your home or its contents that are caused by the perils actually named in the policy. If your property is damaged due to a peril not listed in the policy, your insurance company will not pay for the damage. The “named peril” policy covers most but not all of the common causes of damage to a person’s home or belongings. If you are considering purchasing this type of policy, be sure that you are satisfied with the coverage that will be provided. \nMost companies also sell a homeowners policy that combines the features of the “open perils” policy and the “named peril” policy. This policy is called the Special Form (HO-3). The property damage section of this policy provides “open perils” coverage on the building and other structures by promising to pay for all losses to your property except when the loss was caused by a peril that is specifically excluded by the policy. It provides “named peril” coverage for the contents of your home. The named perils are usually those listed in the Broad Form (HO-2).\nThe “open perils” policy gives much more insurance protection, and often the extra premium for this type of policy is relatively small. When shopping for insurance, ask for a price quotation on both an “open perils” policy and a “named peril” policy. If the difference in price does not seem large, you may want to buy the “open perils” policy. If you do, you will have purchased much more insurance coverage.\nA Quick Summary of Coverage Under Each Type of Policy\n\nThe HO-2 (Broad Form) is a named peril policy and covers the following perils:\r\n\t\nFire and lightning\nRemoval of property endangered by any insured peril\nWindstorm\nHail\nExplosion\nRiot and civil commotion\nVehicle or aircraft damage to your property\nSmoke\nVandalism and malicious mischief\nBreakage of glass\nTheft\nFalling objects\nWeight of ice, snow, or sleet damage\nCollapse of building and any part thereof\nSudden and accidental damage, cracking, burning, or bulging from steam or hot water heating system or appliances for heating water\nAccidental discharge or overflow of water or steam from plumbing or heating systems\nFreezing of plumbing, heating, or air conditioning systems and domestic appliances\nSudden and accidental injury from artificially generated electrical currents\nLimited coverage for trees, shrubs, or plants\nAdditional living expenses\nPersonal liability insurance protection\nMedical payments coverage\n\n\nThe HO-3 (Special Form) provides the following coverage:\r\n\t\nUsually covers a building against all perils except flood; earthquake; neglect; war; nuclear accident; damage resulting from freezing of an unoccupied building; enforcement of an ordinance; damage to fences, patios, swimming pools, etc., by freezing, thawing, or pressure or weight of ice or water; interruption of power or other utility away from insured premises; and windstorm or hail damage to overhead structures, fences, seawalls, green-houses, wharves, etc.\nCovers personal property against damage or loss caused by perils listed in Form HO-2. Check your policy for a complete listing of perils excluded.\n\n\nThe HO-4 (Renters Insurance) provides the following coverage: Insures your household contents, personal possessions, additional living expenses, liability coverage, and medical payments. It covers all perils listed in the HO-2 Form. D.\nThe HO-5 (Comprehensive Form) covers both your real and personal property against all perils except flood, earthquake, war, neglect, nuclear accident, and others specified in your policy. Check your policy for a complete listing of perils excluded.\nThe HO-6 (Condominium Unit Owners) is available for condominium unit owners to insure their personal property and may include any additions or alterations not insured by the condominium association. There are limits to the alterations and additions coverage. You should discuss increasing this coverage with your agent. The policy covers all perils listed in the HO-2 Form. \r\n\tFor complete protection, a condominium owner should also be covered by a policy covering the condominium association. Usually the association purchases the coverage. The association policy should cover the basic structure and common property as well as liability for injuries on common property. You should know what is covered under the association’s policy in order to determine if any additional protection is needed under your HO-6 policy. For example, you should discuss the benefits of purchasing additional coverage for loss assessments.\nThe MV (Market Value Form) is designed for older homes, usually constructed in a way that it is not economically feasible to duplicate following a loss. The MV allows owners of older homes to carry lower limits of insurance, such as the market value of the home rather than the 80% of replacement cost used for newer homes. The policy contemplates returning the property to serviceable condition with the use of commonly used materials, not necessarily materials of the same kind and quality as the original.\n\nBuying the Correct Amount of Coverage\nThe most common mistake made by people buying homeowners insurance is not buying enough coverage. It is very easy to continue buying the same amount of insurance year after year even though the value of your home is increasing due to inflation and improvements which you make. If you are not careful, this can have an unfortunate impact on what you collect from your insurance company if your home is damaged, even if the loss is small. It is important to check your insurance every year to be certain that you have adequate coverage. When deciding how much insurance you need, you must also decide whether you want to purchase an “open perils” or “named peril” policy.\nSome of the factors that you should consider when buying homeowners insurance are outlined in this section. You should also discuss your insurance needs with an insurance agent. It is this person’s job to help you choose the right type and amount of insurance.\nTypical Coverages\n\n\n\nProperty Damage Policy Coverage\nPolicy Limit\n\n\n\n\nDwelling\n$100,000\n\n\nOther Detached Buildings (garage, toolshed, etc.)\n10% of the dwelling policy limit ($10,000)\n\n\nPersonal Property on Premises\n50% of the dwelling policy limit ($50,000)\n\n\nPersonal Property off Premises\n10% of the contents coverage limit ($5,000)\n\n\nAdditional Living Expenses\n20% of the dwelling policy  limit ($20,000)\n\n\n\n\n\n\n\n\n\n\r\n \r\n\n\n\nLiability Policy Coverage\nPolicy Limit\n\n\n\n\nPersonal Liability \n$100,000 each occurrence\n\n\nMedical Payments\n$1,000 each person\n\n\n\n\n\n\r\n \r\nChoosing Your Policy Limits\nThe first step towards determining what policy limits you need is to determine what it would cost to replace your house. The best way to do this is to have an appraiser estimate how much it would cost to rebuild your home if it were totally destroyed and document his estimate in writing. However, appraisals are expensive, so you may want to rely on advice from your insurance agent. Most agents have charts and home replacement cost estimation procedures to help you determine how much insurance you need. If you are not sure of the replacement cost of your house, ask your agent for help.\nNext, take inventory of everything you and your family own in your home and other buildings on your property. You should include everything except autos, animals, and items that are insured under other policies. One simple way of making an inventory is with a camera. Use a flash or video camera for a visual record of your belongings. These pictures, your insurance policy, and any receipts you have supporting the value of the property insured should be stored away from home, possibly at work or in your safe deposit box. This inventory provides an estimate of the value of your belongings, and it will also help you to collect if you ever have to make a claim.\nYou need some idea of what your property is worth before you can make an informed decision about how much insurance you need. Then consider:\n\nHow much your furniture and other personal property are worth; \nHow much you are willing to pay out of your pocket for small losses; and \nHow much the insurance will cost.\n\nThings to Consider When Choosing Your Policy Limits If You Own Your Home\nYou should purchase an amount of insurance on your dwelling at least equal to 80% of its replacement cost. Replacement cost is the amount of money needed to rebuild your house buying all the materials and labor at current prices. Replacement cost can be a lot different from the price you paid for your home. \nWhile it is true that most damage to homes does not result in a total loss, buying less than total insurance coverage will not fully cover small losses. The 80% replacement cost provision contained in most homeowners policies in Virginia means that you will receive only partial payment for even small losses unless you have coverage at the time of the loss equal to or greater than 80% of the replacement cost of your home. This policy provision is used by insurance companies to assure that rate levels are fair and equitable and to encourage homeowners to buy the amount of insurance they need. \nIf you purchase an amount less than 80% of the replacement cost of your dwelling, your insurance company will not be obligated to pay the total cost of a loss to your dwelling even if there is a small loss. In this case, you will only be entitled to receive the larger of either (1) the “actual cash value” of the loss or (2) a prorated value of the loss based on the ratio of theamount of insurance you purchased compared to the amount of insurance you should have purchased. “Actual cash value” is the amount it would take to replace the property minus a deduction for depreciation due to age and normal wear. For example, if a fire occurs in your kitchen and your policy limits are at least 80% of the replacement cost of your home, your insurance company will pay to complete necessary repairs. If your policy limits are less than 80% of the replacement cost, you will have to pay for a significant portion of the repairs yourself. \nEven if you purchase adequate insurance now, it may not be enough in the future. Inflation and rising construction costs increase the replacement cost of your home every year. You need to review and probably increase the policy limits on your home regularly to be sure you have enough insurance. \nSome companies offer endorsements that will automatically increase the policy’s building and contents limits to keep up with inflation. You may wish to contact your agent or company to help you decide whether you need any additional coverage.\nThings to Consider When Choosing Policy Limits for the Contents of Your Home\nGetting full coverage on your personal items also takes special care. Usually it is best to get extra insurance for your most valuable possessions by listing each item separately on a Scheduled Personal Property Endorsement to your homeowners policy. This is especially important for those items for which coverage may be limited such as furs, jewelry, manuscripts, coin or stamp collections, securities, money, and gold or silver. It is also important for those items that are particularly valuable such as fine arts, musical instruments, antiques, photographic or stereo equipment, video equipment, oriental rugs, silverware, etc.\nListing these items specifically means that coverage for your most valuable belongings will be excluded from the policy limit that applies to all your other personal property. It also means your insurance company will have an indication of what you felt the value of the property was at the time the policy was issued. This indication of value can usually help you to obtain a more satisfactory settlement should a loss occur.\nYour personal belongings still may not be fully insured even though you have extra insurance on your most valuable items. The contents of your home may be worth more than 50% of the amount of insurance you have on your dwelling. If the contents of your home are worth 70% to 90% of the value of the house itself (separately listed items should be excluded), you should let your insurance agent know. It is possible to amend your homeowners policy to provide additional coverage.\nIn most cases, the usual homeowners policy will not provide replacement cost coverage for your personal belongings that are damaged or destroyed by a covered peril. Instead, you will be paid only the “actual cash value” regardless of your policy limits. This means you will receive the replacement cost minus depreciation for age and condition. Unless your property is brand new or you can prove that it increased in value over time, you will not be able to replace the item with your claim payment. However, it is possible to purchase a homeowners policy in Virginia that will pay the full replacement cost of your personal belongings. This means that there will be no deduction for depreciation due to age and normal wear. For example, a suit you purchased three years ago for $200 is destroyed in a fire. The same suit today might cost $250. Under some homeowners policies, the insurance company would estimate how much the suit’s value had depreciated over the three-year period and subtract that amount from $250 to arrive at the amount of your claim payment. This would probably mean that the settlement offer would be significantly less than $200. However, if you had purchased a policy providing full replacement cost coverage, your claim payment for the suit would be $250.\nWhen buying or renewing your homeowners insurance policy, you should ask your agent if your company sells a policy providing replacement cost coverage on the contents of your home. The price for this type of policy will be higher, but you may decide that it is worth it.\nDeductibles\nMost homeowners insurance policies sold in Virginia have a deductible amount of $500. This means that you agree to pay $500 out of your own pocket to repair damage to your home or its contents before you are entitled to collect from your insurance company on each property damage claim you make. This deductible does not apply to claims under the liability or medical payments coverage. You may purchase a homeowners policy with a larger deductible amount. For example, deductibles of $1,000 and higher are available. If you choose a higher deductible, your annual premium will be less. The disadvantage of a larger deductible is that you will have to pay more out of your own pocket each time a claim occurs. Ask your agent or company how much your premium will be reduced by increasing the deductible. \nIn addition to the deductible you select for your policy, many insurers have a separate deductible that applies to wind, hail, or named storms, such as hurricanes or tropical storms. Some wind or hurricane deductibles are written as a flat amount, such as $2,000, while others are applied to the loss as a percentage of the amount of insurance coverage on the dwelling. For example, assume a hurricane causes damage to your house or your personal property amounting to $5000, and your dwelling is insured for $200,000. If your policy has a 2% hurricane deductible, you would be responsible for the first $4,000 of damage, and the company would pay $1,000. If your policy has a 5% hurricane deductible, you would pay the first $10,000 of the loss. In this case, the company would pay nothing toward the $4,000 cost of repair. Be sure that you discuss all the deductibles that apply to your policy with your agent or your insurance company.\nIf your insurance company increases your deductible at your policy renewal, it must tell you and explain how the new deductible will work. If your insurance company has increased your deductible significantly, you may wish to shop around to determine if you can find coverage with a lower wind or hurricane deductible.\nShopping for Homeowners Insurance\nVirginia has a competitive rating law. This means that different companies will be charging different prices for homeowners insurance. You are likely to get a better price if you compare the homeowners policies of several companies before you buy. If you shop around by contacting a number of insurance agents or companies, you will find a combination of quality and price that fits your particular needs. \nIf you decide to shop for homeowners insurance, the first step towards a careful purchase is to know the value of your property. Then, you should call several insurance companies or agents and ask each one to give you a quotation of what the annual premium would be for insuring your home. Tell each one how much insurance you want, and describe your home and its contents. Keep track of the prices that they give you on the Homeowners Insurance Shopper’s Worksheet. The worksheet will give you a good idea of the type of information that is necessary to give to the company. \nThe Bureau of Insurance publishes a consumer guide designed especially for comparing sample homeowners insurance premiums in Virginia. Contact the Bureau for a copy of this guide. \nPrice is important, but it should not be the only thing you consider when choosing your insurance company. Once you have narrowed your search to two or three companies with the best range of prices, you should consider each company’s:\n\nreputation for financial stability; \npolicyholder service; \nunderwriting practices; and \nclaims handling practices.\n\nOther Types of Coverage\n\nMobile Home Policies\n\nAlthough much of the information contained in the previous sections of this booklet is generally applicable to mobile-homeowners insurance, the information contained in this section of the booklet is specifically applicable to mobile-homeowners insurance. There are some special considerations of which you should be aware. Owners of houses do not have to worry about accidents that may occur while their homes are moving down the highway, and they do not have to worry about burglars stealing the entire house and all its contents. Here are some special considerations for those purchasing mobilehomeowners insurance:\r\n\t\t\nSome companies require notice before your mobile home is moved or all protection under the policy may be suspended. Also, the typical mobile-homeowners policy usually does not cover collision damage to your mobile home incurred on the highway. You can usually buy trip collision coverage from your company to cover a certain number of days while you move your mobile home. If you plan to move, contact your agent or company to be sure that you have the insurance coverage that you think you should have.\nWhen you buy a mobile home, you may be offered credit life and credit health insurance. These coverages are designed to repay any outstanding loan on the mobile home if you die or are disabled. Very often the price of these coverages is extremely high. Virginia law says that you cannot be forced to purchase credit insurance. You should consider purchasing other types of life and health insurance especially if you are young and in good health.\nIf you own a mobile home, you should consider the increased likelihood of loss that you face compared to owners of traditional homes. The construction of a mobile home makes it more likely to be damaged by high winds and falling trees, and the proximity to other homes can increase the likelihood of exposure to fire. Insurance protection for mobile homes may be even more important than for owners of traditional homes.\n\n\n\n\nFarm or Ranch Policies\n\nIf you are a tenant farmer or if you own a farm, you should purchase a farmowners policy. This type of policy is sold by most insurance companies in Virginia. A farmowners policy resembles a homeowners policy in many ways. The information contained in the first seven sections of this guide generally applies to farmowners insurance. In addition, you should be aware of the following:\r\n\t\t\nA farmowners policy may not automatically provide replacement cost coverage. Replacement cost coverage may be available for the main dwelling, but actual cash value may apply to the other structures. In addition, all structures may not be covered; it may be necessary to list the covered structures in the policy.\nCrops, livestock, and farm equipment usually must be insured under separate policies. Check with your agent to make sure that your entire farm operation is adequately insured.\n\n\n\n\nFlood Insurance\n\nHomeowners insurance policies issued in Virginia generally do not provide coverage for damage to your home and belongings due to floods, surface water, or surges. However, flood insurance is available through the National Flood Insurance Program (NFIP), so be sure to contact your insurance agent or company about purchasing this coverage. Additionally, you can visit the National Flood Insurance Program website for contact information and additional resources.\nThe NFIP provides coverage for direct flood and flood-related damage to homeowners, renters, and business owners in communities that adopt and enforce floodplain management ordinances to reduce future flood losses. Keep in mind, in most cases, there is a 30-day waiting period before a new flood insurance policy becomes effective.\nFlood is defined by the NFIP as a general and temporary condition of partial or complete inundation of two or more acres of normally dry land area or of two or more properties (at least one of which is the policyholder’s property) from:\r\n\t\t\nOverflow of inland or tidal waters;\nUnusual and rapid accumulation or runoff of surface waters from any source;\nMudflow; or\nCollapse or subsidence of land along the shore of a lake or similar body of water as a result of erosion or undermining caused by waves or currents of water exceeding anticipated cyclical levels that result in a flood as defined above.\n\n\nNearly all direct physical losses by “flood” are covered under the program. Losses from water seepage, sewer back-up, or hydrostatic pressure are only covered when they are directly caused by a general condition of flooding and only if you purchase an amount of insurance on your building at least equal to 80% of its replacement cost.\nCoverage is available to any owner of property, including condominium associations, farms, and builders of a building being constructed. Contents coverage is also available for an additional premium. Tenants in eligible communities may also apply for coverage under this program to insure their personal property against flood loss.\nIf you need additional information about the types of property that are not insurable under the NFIP or limits on the available amounts of insurance, you should contact your insurance agent, your company, or the NFIP.\n\n\n\nWhat You Should Know About Force-Placed Property Insurance\nIf you finance the purchase of a home, your lender may require you to carry fire insurance on that property. If you do not purchase fire insurance, the lender may “force place” coverage for you, and you will have to reimburse the lender for the premiums paid. This is called force-placed property insurance coverage, and it generally only protects the interest of the lender and may not cover any of your personal property. \nIn addition, if you finance the purchase of any personal property, such as an appliance or furniture, it is likely that the retailer or person that extends you credit may require you to carry insurance or offer you an opportunity to purchase insurance on the item that you financed. The retailer may ask if you would like to purchase credit property insurance to cover loss to that property. Even though the retailer may require you to purchase insurance, you can purchase property insurance coverage from an insurer or agent of your choice. Furthermore, you should not purchase credit property insurance coverage if it duplicates the property insurance coverage you already have because most policies do not allow you to collect twice. Check with your agent if you are not sure whether you have purchased duplicate coverage. \nRemember, if you do purchase credit property insurance, you have 10 days to change your mind and get a full refund. \nAlso, be aware that if you purchase credit property insurance through your credit card company, your premium is based on the monthly outstanding balance, which can include anything that has been charged to your credit card. However, your insurance coverage applies only to tangible personal property. Therefore, you could be paying premiums on items not covered under your policy such as meals, gasoline, and entertainment.\nWhat You Should Do If You Have Problems Obtaining a Policy\nIf you have been turned down by one company for homeowners insurance, try other companies. Do not assume that you will be turned down by all companies. Just as companies have different premiums, they also have different underwriting requirements. Keep trying. \nYou may not be able to buy one of the usual homeowners policies if your home is in need of repair. If you are unable to purchase a package homeowners policy because repairs are needed or because of some other reason, you may be able to purchase two separate policies, one containing coverage for your home and personal property and the other containing liability coverage. This may be more expensive than purchasing a homeowners policy, but it is better than having no coverage at all. \nIf you are unable to obtain insurance for your home from a private insurance company after trying the above alternatives, limited insurance protection is available through the Virginia Property Insurance Association.\nVirginia Property Insurance Association \nThis association provides property insurance coverage for fire, lightning, removal, hail, explosion, riots, smoke, vandalism, and malicious mischief. Coverage for glass breakage is not included. There is also a broader policy available for eligible properties. This policy provides coverage for several more causes of loss, including glass breakage. Liability insurance and theft coverage may also be purchased but only if the property is eligible. This program should be a last resort because the premium is generally higher and the coverage is frequently more limited than in policies sold by private companies. \nFor further information, contact any insurance agent. Additionally, you can visit the Virginia Property Insurance Association website for contact information and additional resources.\nThings You Can Do to Protect Your Property\n\nKeep your home free of oily rags and trash buildup, and do not store a lot of gasoline. \nDo not store combustible items in the attic, basement, or any place where heat builds up. \nBuy a fire extinguisher, and keep it handy. \nInstall smoke detectors and deadbolt locks, and consider installing an approved fire and burglar alarm system. \nPractice home fire drills. Everyone should know what to do if there is a fire.\nCheck lamps, lamp cords, and light switches to make sure there is no faulty wiring. \nTeach your children not to play with matches. \nIf you purchase a wood stove, have a professional install it. \nPlace decals on the windows of the rooms of children or the elderly so that they can be evacuated in an emergency. \nNever smoke in bed. \nKeep a record of the serial numbers of your valuable possessions. \nKeep your sidewalks in good condition. \nWhen you are away from home, get a neighbor to check your house. Use a timer to turn your lights on and off, lock all windows and doors, and consider notifying the police if you will be away for an extended period of time. \nDo not hide your keys in a special place outside your home. Usually burglars know where to look for keys. \nAdd window locks and peepholes. \nMake sure the exterior of your house is well lighted.\nPrepare an inventory of your household personal property before you have a loss. Whenever possible, include the make, model, and serial number of each item. Your agent or insurance company may be able to provide you with a booklet or a form you can use to record your inventory. You may also wish to prepare a video inventory of your home and your personal property. Keep your inventory in a safe place, such as a safe deposit box, where it cannot be lost or damaged.\nIf you make an addition to your home, remember to increase your insurance coverage.\n\nWhat You Should Do If You Have a Loss\nWhen you suffer a loss and wish to file a claim, you should contact your insurance agent or company immediately. The sooner you file your claim, the sooner you can expect to receive payment. Your homeowners insurer may require that a notice of claim be in writing. Your agent or insurer will provide you with instructions on how to proceed.\nRemember that your insurance policy sets time limits for getting certain things done. If you do not fill out your claim forms promptly or if you fail to protect your property from further damage or otherwise fail to cooperate with your insurance company, your claim may not be settled to your satisfaction. All homeowners policies issued in Virginia require you to do the following when a loss occurs:\n\nGive immediate notice of a possible claim to your agent or company. If the loss is by theft, notify the police. If you have lost your checkbook or credit cards, notify the bank or credit card company. \nProtect your property from further loss or damage. If you make emergency temporary repairs, keep a record of what you spend. This list could include things like covering broken windows or shutting off the gas. \nGive your agent or company a list of all damaged, destroyed, or stolen property. \nShow the damaged property to your agent or company if asked.\n\r\nIf you feel that the amount of money offered by your insurance company to pay for a loss is not fair, there are several alternative courses of action that you may consider:\r\n\r\n\nYou can request that the loss be valued by appraisers who do not work for your insurance company; or \nYou can hire a lawyer to represent your best interests.\n\nOther Insurance Policies Homeowners Should Know About\nMortgage Guaranty Insurance \r\nMortgage guaranty insurance protects the mortgage company when a homeowner fails to pay the mortgage payment(s). The mortgage company may require the homeowner to purchase mortgage guaranty insurance in return for lending the money that is needed to purchase the home or condominium. When this insurance is purchased, the homeowner pays the mortgage guaranty insurance premium, and the mortgage company is protected by the mortgage guaranty insurance policy. \nThis is different from the type of “mortgage” insurance a homeowner can buy to pay off the mortgage in the event of death.\nTitle Insurance \r\nTitle insurance policies cover losses if a land title is not free and clear of defects that were not known when the title insurance was written. Title insurance protects the purchaser if there is a defect in the title, such as a lien against the property, that was not discovered at the time of sale. Although a title search is a routine part of the property transfer, it is possible that a search may overlook a lien or claim on the property. \nThere are two types of title insurance. One type insures the mortgage company. Virtually all mortgage companies request title insurance before they will agree to lend money for the purchase of a home or condominium. The other type protects the owner. Since the mortgage company insists on title insurance, for just a few dollars more you can obtain an owner’s title insurance policy to protect your investment. \nVirginia law allows you to negotiate your title insurance rate, so be sure to talk to your title insurance agent or title insurance company about getting the best rate possible. Also, if you are refinancing your mortgage, be sure to ask if the title insurance company offers a discount or re-issue rate.\nFrequently Asked Questions\n\nMy policy has a limit for other buildings and structures, but I do not have a garage or a shed. Am I paying for coverage I do not need?\n\nThe homeowners policy is a package policy designed to meet the needs of most homeowners. Although it may provide some coverage that you do not need, it is less expensive for the company to issue a policy this way than to tailor it to each policyholder’s needs. The result is a policy that provides broader coverage at a lower price. \n\n\nI submitted a claim for damage to my dwelling. I have replacement cost coverage, but my insurance company only paid part of the cost of repairs. Can they do that? \r\n\t\nThe homeowners policy provides replacement cost coverage for covered buildings without deduction for depreciation. Usually, the insurer makes an initial partial payment (based on the actual cash value of the building). Once the property has been repaired or replaced, the insurer will pay the difference, up to the policy limits, between the amount already paid and the cost to repair the damaged portion of the building with similar construction. It is important to remember that if you elect to repair or replace the building, you must notify the insurer of your intention to do so within 6 months from the date of the insurer’s last actual cash value payment. Also, your policy requires you to make repairs within a reasonable length of time, so always work closely with your insurer.\n\n\nI recently submitted a claim for several items stolen from my home. The insurance company indicated it will not pay my claim unless I submit bills, receipts, or related documents that will prove I owned these items and justify the values that I am claiming. Do they have the right not to pay unless I give this information?\n\nYes. The insurance company has the contractual right to request any information it feels is necessary to confirm ownership and value of the items claimed. The ultimate responsibility of proving the loss is yours.\n\n\nIs there a grace period for late payment?\n\nNo. The company may cancel your policy for nonpayment if the payment is even one day late. \n\n\nHow long does a company have to settle my claim? \r\n\t\nThe company should acknowledge receipt of your claim within ten working days. There is no specific time limit in which the company must settle your claim since each claim is different and the length of time to settle may vary. However, the company should advise you every forty-five days after notification of the claim the reasons why additional time is needed for investigation. \n\n\nI just received a nonrenewal notice because of two claims I made over the past couple of years. Why has the company nonrenewed my policy when these claims were not even my fault? \r\n\t\nInsurance companies develop guidelines that help them determine if you still qualify for their policy. Companies’ guidelines will vary. Although companies are concerned if a loss is the result of negligence, they also review and consider the size of all losses and how often losses occur.\n\n\nCan an insurance company refuse to issue me a policy or increase my premium if I have bad credit or if someone in my household has bad credit?\n\nYes, but your insurance company cannot nonrenew your policy solely on the basis of your credit report. If an insurance company takes an adverse action based in whole or in part on your credit report, the insurance company must tell you the primary characteristics that were used as the basis for the adverse action or tell you that you have the right to request this information. Also, if your insurance company uses your credit report to rate or underwrite your policy, it must tell you at the time of application that you have the right to request that your credit report be updated (no more than once during any policy term) and that you have the right to question the accuracy of the credit information. Certain factors may not be used when evaluating your credit information, such as your income, gender, address, zip code, ethnic group, race, color, religion, marital status, and nationality. Other factors are prohibited, too, such as information shown on your credit report as being in dispute, insurance inquiries, nonconsumer initiated inquiries, and those indicated as being medical industry accounts.\n\n\nMy insurance premiums are paid by my mortgage company. Can I shop for a better rate and change companies? \r\n\t\nYes, you have all the rights and privileges of a consumer who pays the premium directly to the company. However, some mortgage companies require advance notice of a change in insurance companies. Check with your mortgage company’s insurance monitoring department for their requirements.\n\n\nDo I need additional coverage under my homeowners policy if I have a business in my home? \r\n\t\nLiability and property coverage associated with a business is often excluded under the homeowners policy. Therefore, you should contact your agent or your company to determine if you are adequately protected. You may have to purchase additional coverage to protect the property that you use in your business or to protect you against any liability that may arise from your business operations.\n\n\nWill my homeowners policy pay for damage to my home caused by an earthquake? \r\n\t\nGenerally, a homeowners insurance policy does not provide any type of coverage against damage caused by earthquake. Get in touch with your agent if you have questions regarding this type of coverage. \n\n\nWill my homeowners policy cover property damage resulting from mold? \r\n\t\nIf mold is a consequence of another loss that is covered under your homeowners policy, the consequential mold loss is covered. However, if mold is the direct cause of loss, it is excluded. \n\n\nWill my homeowners policy cover property damage resulting from acts of terrorism? \r\n\t\nTerrorism exclusions are not allowed under the homeowners policy in Virginia. However, the act of terrorism must result in damage to your property from an otherwise covered peril. \n\n\nIs a boat covered by my homeowners policy? \r\n\t\nMost homeowners policies provide a small amount of property coverage for watercraft. The amount of coverage may vary, but $1,000 is typical. If you need additional coverage, you should ask your agent or company. Since watercraft is “personal property,” the causes of loss and exclusions applicable to personal property or contents apply. It is important to note that watercraft (except row boats and canoes) is NOT covered for windstorm or hail unless the property is inside a fully enclosed building. \n\n\nCan I purchase identity theft coverage under my homeowners policy?\n\nSome insurance companies offer this coverage. Check with your agent or insurance company to see if this coverage is available.\n\n\n\nWhat About Insurance Complaints?\nKnow Your Rights\r\nIf an insurance company refuses to issue a homeowners policy or cancels or nonrenews your policy, Virginia law requires that the company tell you the reason why. If you are refused insurance, make the request for the reasons. If you are denied insurance based on incorrect information, the company is required to allow you to copy its file concerning you and to correct any incorrect information that the file may contain. \nHowever, you may not be refused insurance solely because of your age, sex, residence, race, color, creed, national origin, ancestry, marital status, or lawful occupation, including the military service. Also, you may not be refused insurance:\n\nsolely because of the age or location of your home; \nsolely because of a previous owner’s losses; \nbecause you were denied insurance by another company; or \nbecause you purchased insurance through the Virginia Property Insurance Association.\n\r\nExcept for the reasons stated above, an insurance company may cancel a new insurance policy within the first 90 days of issuance for any reason. Also, you should know that Virginia law prevents an insurance company from canceling your owner-occupied homeowners policy after the first 90 days except for specific reasons. This cancellation law applies to your homeowners policy only if you own your own home; it does not apply to renters policies. The specific reasons for canceling your owner-occupied policy after the first 90 days are:\r\n\r\n\nfailure to pay the premium for the policy when due; \nconviction of a crime arising out of acts increasing the hazard insured against;\ndiscovery of fraud or material misrepresentation; \nwillful or reckless acts or omissions increasing the hazard insured against as determined from a physical inspection of the insured premises; or \nphysical changes in the property that result in the property becoming uninsurable as determined from a physical inspection of the insured premises. \n\nA company is allowed to nonrenew your homeowners policy at the end of a term for any reason if you are given 30 days’ written notice prior to the expiration date of your policy. However, the company cannot refuse to renew your policy solely because of your age, sex, residence, race, color, creed, national origin, ancestry, marital status, or lawful occupation, including the military service. Nor can the company nonrenew your policy solely because of any claim resulting primarily from natural causes, because of an inquiry you made about your coverage or your policy provisions, because of credit information, or because of claims that are older than 5 years.\nA company intending to nonrenew your homeowners policy must give you notice in writing stating the termination date and the reason for termination. The notice must also tell you that you have a right to appeal to the Insurance Commissioner and that you might be eligible for insurance through the Virginia Property Insurance Association.\nThe cancellation and non-renewal laws do not apply to renters insurance. Check your renters policy for the applicable termination provisions, or call your agent or company if you have any questions. \r\nAs a policyholder, you have the right to collect the benefits promised should a loss occur. If you make a claim and you believe that your insurance company is not living up to its contractual obligations, you can force the company to honor your valid claims.\nWhen a Problem Occurs\n\nContact Your Agent or Company\n\n​​If you believe your policy was improperly terminated or denied homeowners insurance illegally or if you believe your insurance company has refused to pay all or part of a valid claim, you have the right to question and to complain. Your first step should be to contact your agent or company. Sometimes a mistake has been made, and it will be corrected if an inquiry is made. When making contact, supply your name, address, telephone number, policy number, type of policy, and the nature of your complaint. A complaint by letter is best. Keep a copy of your letter. If you complain by telephone, keep a written record of: \r\n\r\n\t\t\nThe date and time of your call. \nThe name of the person you talked to.\nWhat was said during the call.\n\n\n\n\nHelp from the Bureau of Insurance\n\nIf you do not receive a prompt, courteous, and satisfactory response, you may need to get help to resolve your problem. The State Corporation Commission Bureau of Insurance provides free professional information and complaint service to all Virginia residents. To use these services you can visit the State Corporation Commission Bureau of Insurance website for contact information and additional resources.\nYou may use the Property and Casualty Insurance Complaint Form, or file electronically from the State Corporation Commission Bureau of Insurance website. \nThe Bureau of Insurance will: \r\n\t\t\nThoroughly investigate your complaint;\nSee that you get a clear response to your questions; \nCut through red tape; and \nCorrect misunderstandings.\n\n\nBut the Bureau cannot:\n\n​Force a favorable action on your complaint if it is not supported by facts and law. \nProvide legal services that are sometimes required to settle complicated problems.\n\n\nIf the Bureau is unable to resolve a problem, we will tell you why. If the law and facts are on your side, we will try to see that your rights are protected and that your complaint is resolved in a satisfactory manner.\n\n\n\nGlossary\n\nactual cash value (acv) – the value of the property is figured by determining what it would cost to replace the property (see replacement cost) and is then adjusted by subtracting an amount that reflects depreciation. \nadditional living expense – covers additional temporary expenses for hotel/apartment living while you are unable to live in your home because of damage caused by a peril covered by your homeowners policy. This does not cover all your expenses, only that amount which is above and beyond your normal living expense. Should you stay with family or friends and do not create extra expense, no payment will be made. \ncommission – a percentage of the policy premium that an insurance company pays to an insurance agent for servicing the account. \ndeductible – an amount that you pay in a property claim.  The deductible may be a specific amount, such as $1,000, or it may be a percentage of the dwelling coverage. \nliability coverage – coverage for injury to another person or another person’s belongings when the loss is your fault. \nmedical payments coverage – covers medical expense for a person who is injured in an accident at your home even if you are not at fault (medical payments coverage does not include coverage for you or a member of your household). \nnamed peril policy – covers any loss that is caused by one of the covered perils named (specified) in the policy. \nopen perils policy – covers damage or loss from all causes except causes that are specifically excluded. \nother structures – detached buildings on your property (such as a tool shed or garage).\nperil – cause or event that causes a loss (such as fire, lightning, theft, etc.). \npersonal property or contents – includes everything in your home such as clothes, furniture, appliances, etc. \nproperty damage coverage – coverage for your house and personal property. \nreplacement cost – the replacement cost of a building equals the amount it would cost to construct the house or building today using materials of the same kind and quality. The replacement cost of a house does not include the value of the land.\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nAbout\n\n\nCommission Overview\n\n\nContact Us\n\n\nSCC Expenses\n\n\nSCC News\n\n\nWeb Policy\n\n\n\n\nCareers\n\n\nJob Openings\n\n\nBenefits\n\n\n\nConnect with the SCC\nOn Facebook\nOn Twitter\nOn LinkedIn\n\n\n\n\n\r\n                        © 2020-2024 State Corporation Commission. All Rights Reserved.\r\n                    \n\n\nLast Updated:June 10, 2024 11:23 AM\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.sfbli.com/",
        "raw_text": "\n\n\n\n\n\n\n\n\n\nHome - Southern Farm Bureau Life Insurance\n\n\nUh-Oh!\n×\nYour session timed out.\r\n                    \n\nLogin\nCalculator\nFind Agent\nReport Claim\nCareers\n\n\n\n\n\n\nAbout UsBlogs  ProductsServicesMy PoliciesPay OnlineLogin\n\n\n\n\n\n\n\n\nOur Mission is to be the life insurance company of choice for our Farm Bureau family. Our focus is to provide competitive products and superior customer service to our Farm Bureau policyholders and agents while observing the highest ethical standards.\nUseful Links ServicesAbout UsBLOGSCareersContact Us\nFind an AgentMy ProfileVariable ReportsHealth PlanBehavioral Health Plan\nCorporate InfoPhone: 601-981-7422Death Claims: 1-800-562-0919Policy Service: 1-800-457-96111401 Livingston Lane \nJackson, MS 39213\n2024 © All Rights Reserved\nPrivacy Policy\nTerms of Use\n\r\n    An unhandled error has occurred.\r\n    Reload\n🗙\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
]