[
    {
        "link": "https://www.progressive.com/answers/life-insurance-types/",
        "raw_text": "\n\nDifferent Types of Life Insurance | Progressive\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSite NavigationMenuExplore ProductsGet insurance for almost anything you needClaimsReport/track a claim & learn about the processAbout UsSee who we are, what we stand for & join the teamResourcesTools, answers to your insurance questions, & moreClose Overlay\n\n\nSkip to Main Content\n\n\n\n\nMenuExplore ProductsClaimsAbout UsResources1-866-749-7436 , call us\n\n\nLog InAnswersArticles by Product \n\nArticles by Topic \n\nTypes of life insurance explainedThere are five main types of life insurance: Term life insurance, whole life, universal life, variable life, and final expense life insurance. Each type of life insurance is designed to fill a specific coverage need. For example, term life insurance is geared toward those who just need coverage for a certain number of years, while whole life insurance is designed for those who need straightforward, lifelong coverage. 5 min to readExplore Progressive's editorial standards for Answers articles to find out why you can trust the insurance information you find here.Key takeawaysThere are five main types of life insurance that cater to specific coverage needsThere are alternative types of life insurance that don't require a medical examAnswersLife insurance informationTypes of life insurance explainedGet quoteWhat are the different types of life insurance?\nThe different types of life insurance vary based on their coverage length, complexity, coverage amount, cash value, and other features. \nJump to a section using the links below to learn more about:\n\nTerm life insurance\nWhole life insurance\nUniversal life insurance\nVariable life insurance\nFinal expense life insurance\nOther types of life insurance\n\nCompare the different types of life insurance\nUse this chart to quickly compare the five key types of life insurance policies:Life insurance typeCoverage lengthBest for agesBuilds cash value?Medical exam required?Death benefit amountTermCoverage length10, 15, 20, 30 yearsBest for ages18 – 65Builds cash value?NoMedical exam required?VariesDeath benefit amount$100,000+WholeCoverage lengthYour lifetimeBest for ages18 – 65Builds cash value?YesMedical exam required?Yes*Death benefit amount$50,000+UniversalCoverage lengthYour lifetimeBest for ages18 – 65Builds cash value?YesMedical exam required?YesDeath benefit amount$50,000+Variable†Coverage lengthYour lifetimeBest for ages18 – 65Builds cash value?YesMedical exam required?YesDeath benefit amount$50,000+Final ExpenseCoverage lengthYour lifetimeBest for ages50 – 85Builds cash value?YesMedical exam required?NoDeath benefit amount$2,500 – $40,000Term life insurance\nTerm life insurance is generally more affordable than permanent life insurance. It provides coverage for a set number of years, paying out as long as your policy hasn't expired and you've paid the premiums. You can lock in your rate for the entire term period, which makes budgeting and planning easier.\nAt the end of the term period, and based on the product options available, you may be able to renew your policy at an adjusted rate. However, you can typically only renew a term life policy on a year-to-year basis — not for another term period. Your new rate will be based on your age and health at the time of renewal, and you may or may not need a medical exam to obtain coverage. You may also be able to convert your term life policy to whole life at the end of your term.\nWhole life insurance\nWhole life insurance is a type of permanent life insurance that provides coverage for your entire lifetime, paying your benefit no matter when you pass away — as long as you keep paying your bill. Whole life insurance also includes a savings component that a portion of your premium will pay into. The savings component has a fixed interest rate that builds cash value over time, which is part of the reason whole life policies typically cost more than term life policies with similar coverage.\nThe cash value of your policy won't affect the death benefit paid out upon your passing. However, if it grows to equal your death benefit amount by the time you're a set age (usually 100 or 120), your insurer will terminate your policy and pay out the coverage amount.\nIf you're not banking on living to 100, you can withdraw some cash value funds as a life insurance loan. There's typically no credit check required and a minimal loan approval process. You repay the loan with interest, or if you pass away before returning the funds, the remaining loan amount and interest will be withdrawn from the payout to your beneficiaries.\nUniversal life insurance\nUniversal life insurance is another permanent life insurance option, providing coverage for your entire life as long as you pay the premiums. It's sometimes called adjustable life insurance because it offers more flexibility than a whole life policy. For example, universal life policies allow you to increase or decrease your death benefit and even adjust or skip your monthly premium (within certain limits).\nAs with whole life, a universal life policy has a savings component that grows and allows for borrowing. However, a universal life policy works differently than a whole life policy in two key ways:The interest rate for a universal life policy's cash value is not fixed. You'll have a guaranteed minimum interest rate, but in general, the rate at which your cash value builds can change over time based on market conditions.Your universal life policy's cash value can eventually grow and result in a zero-cost policy, in which all premiums are paid from the built-up value.Variable life insurance† \nVariable life insurance is a riskier type of permanent life insurance. A common variable life insurance policy design is built on two pieces:\nA face value death benefit: Just as with whole life and universal life, when you purchase a variable life policy, you'll select a fixed death benefit to be paid out upon your passing as long as you pay your premiums.\nA variable cash value: Your cash value will rise and fall based on your payments and the performance of your selected investments. Unlike with whole life, your variable life cash value can be part of your death benefit.\nThe greater range of investment options offered by a variable life policy means it could, in the long run, provide a greater benefit to your beneficiaries when you pass away — especially if you're a savvy investor. But it also opens you up to much higher risk, fees, and costs than whole life or universal life policies.\nFinal expense life insurance\nAlso known as funeral or burial insurance, final expense insurance is a type of whole life insurance that offers a smaller and more affordable death benefit designed to help cover your end-of-life expenses like funeral costs, medical bills, or outstanding debt. While other types of life insurance may have age and health requirements, final expense policies can be easier for older or less-healthy individuals to qualify for. A final expense policy's cash value operates the same as a whole life policy's, building value at a fixed rate over time.Pro tip:There are also different types of life insurance riders you can add to a policy to change how your life insurance works under certain circumstances.Other types of life insurance\nIndexed universal life insurance is a type of permanent life insurance with a cash value that grows based on a stock market index such as the S&P 500 or the NASDAQ. You can adjust your premium as the cash value of the policy increases, which can result in a policy whose cash value pays the premiums.Simplified issue life insurance is a type of life insurance that doesn’t require a medical exam. This can be beneficial for healthy individuals who need a policy quickly because the approval process can be much faster. Depending on the insurer and policy, coverage could begin within minutes to a few days compared to a standard life insurance policy that could take a month or longer. This type of life insurance generally costs more and could have a smaller coverage amount due to the increased risk the insurer takes on by simplifying the application process.Instant life insurance is a specific type of simplified issue policy that you can apply for online and often get a decision within minutes. Instant life insurance is similar to simplified issue but may have higher and more affordable coverage options.Guaranteed life insurance is a type of policy that does not ask medical questions and your application cannot be turned down.\nOther kinds of non-traditional life insurance include:\nSupplemental life insurance can provide additional coverage beyond what your company's group life policy offers. You can purchase it from your employer (if offered) or a private insurance company for an additional premium.Survivorship life insurance covers two people on a single policy that pays a death benefit once both policyholders have passed away. A type of joint life insurance, survivorship policies can be part of an estate plan and a way to leave an inheritance for heirs.Decreasing term life insurance provides coverage with a death benefit that gets smaller over time, making the policy more affordable than a standard term policy because the payout diminishes.AD&D insurance is a category of life insurance that will only pay out if the insured person is in an accident that causes death or serious injuries such as the loss of limbs, sight, or paralysis.\nWhat type of life insurance is best for me?\nWhen choosing the type of life insurance that's best for you, consider where you are right now in life by asking yourself these questions:What is your age?Do you have people who depend on your income who would suffer if you were no longer around?What are your investment goals and estate planning goals, or do you just want coverage to pay for your final expenses?Consider how much coverage you'll need using Progressive's life insurance calculator, and what you can afford to pay each month.Get a free life insurance quote online in minutesGet a quoteOr, call 1-866-912-2477Learn more about life insurance policies.Related articlesTerm vs. whole life insurance 4 min to readWhat is the difference between whole life vs. universal life insurance? 3 min to readHow does life insurance work? 5 min to readRelated categoriesInsurance basicsTerms & definitionsHave more questions? Browse articles by insurance typeSee all articles by productCar insurance 425 articlesHome insurance 157 articlesRenters insurance 29 articlesCondo insurance 6 articlesMotorcycle insurance 55 articlesBoat & PWC insurance 36 articlesRV/Trailer insurance 38 articlesLife insurance 90 articlesPet insurance 21 articlesPlease note: The above is meant as general information to help you understand the different aspects of insurance. Read our editorial standards for Answers content. This information is not an insurance policy, does not refer to any specific insurance policy, and does not modify any provisions, limitations, or exclusions expressly stated in any insurance policy. Descriptions of all coverages and other features are necessarily brief; in order to fully understand the coverages and other features of a specific insurance policy, we encourage you to read the applicable policy and/or speak to an insurance representative. Coverages and other features vary between insurers, vary by state, and are not available in all states. Whether an accident or other loss is covered is subject to the terms and conditions of the actual insurance policy or policies involved in the claim. References to average or typical premiums, amounts of losses, deductibles, costs of coverages/repair, etc., are illustrative and may not apply to your situation. We are not responsible for the content of any third-party sites linked from this page.InsuranceInsuranceCar InsuranceHome InsuranceProgressive AnswersExplore All ProductsOur CompanyOur CompanyAbout UsCareersInvestorsNewsroomQuick LinksQuick LinksContinue Previous QuoteReport a ClaimMake a PaymentPerkShareConnectConnect1-866-749-7436Contact UsProgressive AppBecome a PartnerSearch / KeywordsFacebookInstagramYouTubeTikTokX, Formerly TwitterLifelanesContact UsSite MapAccessibility ServicesTechnical HelpPrivacy & SecurityTerms of UseCA Notice at CollectionInsurance ResourcesDo Not Sell or Share My Personal Information (CA Residents Only)THE #1 INSURANCE WEBSITECopyright 1995 - 2024. Progressive Casualty Insurance Company. All Rights Reserved.We offer insurance by phone, online and through independent agents. Prices vary based on how you buy.ΔDiscount varies and is not available in all states or situations.Insurance carrier website ranking by Keynova Group – Q4 2023 Online Insurance Scorecard.Certain term life insurance policies for Arizona, Georgia, Indiana, Louisiana, Maryland, Michigan, Mississippi, Missouri, Ohio, Pennsylvania, Tennessee, Texas, Utah, Virginia and Wisconsin residents are underwritten by Progressive Life Insurance Company.\nProgressive Advantage Agency, Inc. (PAA) refers consumers seeking life insurance to eFinancial, LLC for placement with insurers offering this coverage. eFinancial and the insurers are not affiliated with Progressive and are solely responsible for their websites, products, and services. Information about you is subject to their privacy policies and may be shared with PAA and its affiliates for their marketing and other uses.\nPAA and Progressive are not responsible for insurer or coverage selections, policies issued, claims, the content or operation of others' websites, or how others handle or use your information. Information you provide to others is subject to their privacy policies and website terms of use, and may be shared with us.\nPAA receives compensation from eFinancial or its affiliate that may vary based on the number of applications taken by eFinancial and the policy you buy. Contact us for more details.*Occasionally, a medical exam, test or report will be ordered to assist a customer in clarifying or correcting an item of medical history.†Not currently offered through Progressive.\n\n\n\n"
    },
    {
        "link": "https://www.nerdwallet.com/article/insurance/types-of-life-insurance",
        "raw_text": "\n\n\n\n5 Different Types of Life Insurance & How to Choose in 2024 - NerdWallet\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  Credit cards               Credit cards    View all credit cards      Best credit cardsBest credit cardsBest bonus offer credit cardsBest balance transfer credit cardsBest travel credit cardsBest cash back credit cardsBest 0% APR credit cardsBest rewards credit cardsBest airline credit cardsBest college student credit cardsBest credit cards for groceriesCompare credit cardsGet a card recommendationCard recommendation guideTravel rewards and perksEarn cash backPay down debtMake a big purchaseGet your approval oddsCredit card reviewsCredit card calculatorsBalance transfer savings calculatorCredit card interest rate calculatorGuides and resourcesTravel rewards credit cards0% APR credit cardsCash back credit cardsBusiness credit cardsAirline credit cardsHotel credit cardsStudent credit cardsStore credit cardsResources  Get your free credit score     Credit card basics     Applying for a credit card     Choosing a credit card     Managing credit card debt     Credit card resources          Banking               Banking    Banking guide      Savings accountsSavings account guideBest savings accountsBest high-yield savings accountsSavings accounts alternativesSavings calculatorCDsCD guideBest CD ratesBest 3 month CD ratesBest 6 month CD ratesBest 1 year CD ratesBest 3 year CD ratesBest 5 year CD ratesCD calculatorChecking accountsChecking account guideBest checking accountsBest free checking accountsBest online check accountsChecking account alternativesPayments and transfersNerdWallet's banking picksBest bank bonuses and promotionsBest money market accountsBest credit unionsBank reviewsBanking calculatorsCompound interest calculatorEmergency fund calculator       Home               Home    Mortgage ratesToday's mortgage rates30 year mortgage rates5-year ARM rates3-year ARM ratesFHA mortgage ratesVA mortgage ratesBest mortgage lendersBest mortgage lendersMortgage guideBest mortgage lendersBest lenders for FHA loansBest lenders for low- and no-down-paymentBest VA mortgage lendersRefinance and HELOCRefinancing and equity guideToday's refinance ratesBest refinance lenders30-year fixed refinance rates15-year fixed refinance ratesBest cash-out refinance lendersBest HELOC LendersBuying a homeView our home buying hubGet pre-approved for a mortgageHome affordabilityFirst-time homebuyers guideDown paymentRent vs buy calculatorHow much can I borrow mortgage calculatorInspections and appraisalsMortgage lender reviewsHomeownershipHomeownership guideManaging a mortgageRefinancing and equityHome improvementHome valueHome insuranceSelling a homeHome calculatorsMortgage calculatorDown payment calculatorHow much house can I afford calculatorClosing costs calculatorCost of living calculatorMortgage amortization calculatorRefinance calculatorFirst-time homebuyer's guide       Loans               Loans    Loans guide      Personal loansPersonal loans guideGetting a personal loanPayday Loan AlternativesManaging a personal loanPersonal loan reviewsCompare top lendersPre-qualify for a personal loanPersonal loan calculatorTypes of personal loans  Debt consolidation loans     Best personal loans     Loans for bad credit     Best quick cash loans     Best emergency loans     Best home improvement loans     Cash advances and overdraft protection   Student loansStudent loans guidePaying for collegeFAFSA and federal student aidPaying for career trainingPaying for graduate schoolBest private student loansRepaying student debtRefinancing student debtNerdWallet's student loan calculators  Student loan calculator     Student loan refinance calculator     Student loan payoff calculator   Auto loansAuto loans guideBest auto loans for good and bad creditBest auto loans refinance loansBest lease buyout loansAuto loan calculators  Auto loan calculator     Auto loans refinance calculator     Total car cost calculator          Insurance               Insurance    Insurance guide      Auto insuranceAuto insurance guideAuto insurance ratesBest auto insurance companiesCheapest auto insurancePolicies and coverageAuto insurance reviewsAuto insurance calculators  Auto insurance calculator     Total auto cost calculator   Life insuranceLife insurance guideLife insurance ratesLife insurance policies and coverageLife insurance quotesLife insurance reviewsBest life insurance companiesLife insurance calculatorHome insuranceHomeowners insurance guideHome insurance ratesHome insurance quotesBest home insurance companiesHome insurance policies and coverageHome insurance calculatorHome insurance reviewsMedicareRenters insurancePet insurancePet insurance guideBest pet insurance       Personal finance               Personal finance    View all personal finance      Tracking creditGet your free credit scoreYour credit reportUnderstanding your credit scoreUsing your creditImproving your creditProtecting your creditManaging moneyMoney Management tipsSaving moneyHandling bills and expensesShoppingFinancial healthSavings goal calculatorNet worth calculatorNerdWallet's budgeting basics  Budgeting     Free budget worksheet     How to budget     The best budget apps     Budget calculator     Cost of living calculator   Making moneyGig workMaking money onlineManaging debtPaying debtDealing with debt collectionDebt reliefTravelView all travelBest travel credit cardsReward optimizationTravel insurance       Investing               Investing    Best investment accountsBest IRA accountsBest online brokers for tradingBest online brokers for beginnersBest robo-advisorsBest options trading brokers and platformsBest trading platforms for day tradingExplore investments and accountsView all investmentsStocksFundsBondsReal estate and alternative investmentsCryptocurrencyEmployee equityBrokerage accounts529 college savings plansInvestment account reviewsCompare online brokeragesRetirementRetirement planningSocial Security401(k)s401(k) savings calculatorRoth and traditional IRAsRoth IRA calculatorPlanning and strategyPlanning and strategyBest investments right nowEstate planningFinancial planningInvesting and retirement calculatorsRetirement calculator401(k) savings calculatorRoth IRA calculatorInvestment return calculatorSocial Security benefits calculator       Small business               Small business    Small business guide      Funding your businessSmall-business loansSBA loansBusiness lines of creditBusiness grantsStartup business loansManaging business financesBusiness bank accountsBusiness credit cardsAccountingPayroll & HRBusiness taxesRunning your businessPayment processingE-commerceMarketingBusiness insuranceBusiness legalGeneral business tipsStarting a businessBusiness ideasEntrepreneurship       Taxes               Taxes    View all taxes      Tax strategy and planningTax preparation and filingView all tax preparation and filingTax credits and deductionsTax formsTax software and productsTax preparation basicsNerdWallet tax filingTax brackets and ratesSolving tax issuesFederal income tax calculator         Skip to content           Credit cards      Best credit cards      Compare credit cards     Get a card recommendation      Credit card reviews     Credit card calculators      Guides and resources       View all credit cards         Best credit cards     Best bonus offer credit cards     Best balance transfer credit cards     Best travel credit cards     Best cash back credit cards     Best 0% APR credit cards     Best rewards credit cards     Best airline credit cards     Best college student credit cards     Best credit cards for groceries       Travel rewards and perks     Earn cash back     Pay down debt     Make a big purchase     Get your approval odds     Card recommendation guide       Balance transfer savings calculator     Credit card interest rate calculator      Travel rewards credit cards     0% APR credit cards     Cash back credit cards     Business credit cards     Airline credit cards     Hotel credit cards     Student credit cards     Store credit cards      Resources     Get your free credit score     Credit card basics     Applying for a credit card     Choosing a credit card     Managing credit card debt     Credit card resources             Banking      Savings accounts      CDs      Checking accounts      Payments and transfers     NerdWallet's banking picks      Bank reviews     Banking calculators       Banking guide         Best savings accounts     Best high-yield savings accounts     Savings accounts alternatives     Savings calculator     Savings account guide      Best CD rates     Best 3 month CD rates     Best 6 month CD rates     Best 1 year CD rates     Best 3 year CD rates     Best 5 year CD rates     CD calculator     CD guide      Best checking accounts     Best free checking accounts     Best online check accounts     Checking account alternatives     Checking account guide       Best bank bonuses and promotions     Best money market accounts     Best credit unions       Compound interest calculator     Emergency fund calculator            Home      Mortgage rates      Best mortgage lenders      Refinance and HELOC      Buying a home      Homeownership      Selling a home     Home calculators      First-time homebuyer's guide        Today's mortgage rates     30 year mortgage rates     5-year ARM rates     3-year ARM rates     FHA mortgage rates     VA mortgage rates     Best mortgage lenders      Best mortgage lenders     Best lenders for FHA loans     Best lenders for low- and no-down-payment     Best VA mortgage lenders     Mortgage guide      Today's refinance rates     Best refinance lenders     30-year fixed refinance rates     15-year fixed refinance rates     Best cash-out refinance lenders     Best HELOC Lenders     Refinancing and equity guide      Get pre-approved for a mortgage     Home affordability     First-time homebuyers guide     Down payment     Rent vs buy calculator     How much can I borrow mortgage calculator     Inspections and appraisals     Mortgage lender reviews     View our home buying hub      Managing a mortgage     Refinancing and equity     Home improvement     Home value     Home insurance     Homeownership guide       Mortgage calculator     Down payment calculator     How much house can I afford calculator     Closing costs calculator     Cost of living calculator     Mortgage amortization calculator     Refinance calculator             Loans      Personal loans      Student loans      Auto loans       Loans guide         Getting a personal loan     Payday Loan Alternatives     Managing a personal loan     Personal loan reviews     Compare top lenders     Pre-qualify for a personal loan     Personal loan calculator     Personal loans guide      Paying for college     FAFSA and federal student aid     Paying for career training     Paying for graduate school     Best private student loans     Repaying student debt     Refinancing student debt     Student loans guide      Best auto loans for good and bad credit     Best auto loans refinance loans     Best lease buyout loans     Auto loans guide      Types of personal loans     Debt consolidation loans     Best personal loans     Loans for bad credit     Best quick cash loans     Best emergency loans     Best home improvement loans     Cash advances and overdraft protection      NerdWallet's student loan calculators     Student loan calculator     Student loan refinance calculator     Student loan payoff calculator      Auto loan calculators     Auto loan calculator     Auto loans refinance calculator     Total car cost calculator             Insurance      Auto insurance      Life insurance      Home insurance      Medicare     Renters insurance     Pet insurance       Insurance guide         Auto insurance rates     Best auto insurance companies     Cheapest auto insurance     Policies and coverage     Auto insurance reviews     Auto insurance guide      Life insurance rates     Life insurance policies and coverage     Life insurance quotes     Life insurance reviews     Best life insurance companies     Life insurance calculator     Life insurance guide      Home insurance rates     Home insurance quotes     Best home insurance companies     Home insurance policies and coverage     Home insurance calculator     Home insurance reviews     Homeowners insurance guide        Best pet insurance     Pet insurance guide      Auto insurance calculators     Auto insurance calculator     Total auto cost calculator             Personal finance      Tracking credit      Managing money      Making money      Managing debt      Travel       View all personal finance         Get your free credit score     Your credit report     Understanding your credit score     Using your credit     Improving your credit     Protecting your credit      Saving money     Handling bills and expenses     Shopping     Financial health     Savings goal calculator     Net worth calculator     Money Management tips      Gig work     Making money online      Paying debt     Dealing with debt collection     Debt relief      Best travel credit cards     Reward optimization     Travel insurance     View all travel      NerdWallet's budgeting basics     Budgeting     Free budget worksheet     How to budget     The best budget apps     Budget calculator     Cost of living calculator             Investing      Best investment accounts      Explore investments and accounts      Retirement      Planning and strategy      Investing and retirement calculators         Best IRA accounts     Best online brokers for trading     Best online brokers for beginners     Best robo-advisors     Best options trading brokers and platforms     Best trading platforms for day trading      Stocks     Funds     Bonds     Real estate and alternative investments     Cryptocurrency     Employee equity     Brokerage accounts     529 college savings plans     Investment account reviews     Compare online brokerages     View all investments      Retirement planning     Social Security     401(k)s     401(k) savings calculator     Roth and traditional IRAs     Roth IRA calculator      Best investments right now     Estate planning     Financial planning     Planning and strategy      Retirement calculator     401(k) savings calculator     Roth IRA calculator     Investment return calculator     Social Security benefits calculator            Small business      Funding your business      Managing business finances      Running your business      General business tips       Small business guide         Small-business loans     SBA loans     Business lines of credit     Business grants     Startup business loans      Business bank accounts     Business credit cards     Accounting     Payroll & HR     Business taxes      Payment processing     E-commerce     Marketing     Business insurance     Business legal      Starting a business     Business ideas     Entrepreneurship            Taxes      Tax strategy and planning     Tax preparation and filing      Tax brackets and rates     Solving tax issues     Federal income tax calculator      View all taxes          Tax credits and deductions     Tax forms     Tax software and products     Tax preparation basics     NerdWallet tax filing     View all tax preparation and filing                                   \nSearch\n              \n\n\nInsuranceInsurance5 Different Types of Life Insurance, and How to ChooseAdvertiser disclosureYou’re our first priority.Every time.We believe everyone should be able to make financial decisions with confidence. And while our site doesn’t feature every company or financial product available on the market, we’re proud that the guidance we offer, the information we provide and the tools we create are objective, independent, straightforward — and free.So how do we make money? Our partners compensate us. This may influence which products we review and write about (and where those products appear on the site), but it in no way affects our recommendations or advice, which are grounded in thousands of hours of research. Our partners cannot pay us to guarantee favorable reviews of their products or services. Here is a list of our partners.5 Different Types of Life Insurance, and How to ChooseThere are five main types of life insurance to choose from. Here’s a breakdown of what each one covers.Many, or all, of the products featured on this page are from our advertising partners who compensate us when you take certain actions on our website or click to take an action on their website. However, this does not influence our evaluations. Our opinions are our own. Here is a list of our partners and here's how we make money.Updated Nov 19, 2024 · 2 min readWritten by Ryan BradyLead WriterRyan BradyLead Writer | Small-business lending, InsuranceRyan Brady is a lead writer at NerdWallet and authority on small-business lending and insurance. Ryan enjoys simplifying complex finance topics to help small-business owners make smarter financial decisions. His work has appeared in TechCrunch, MarketWatch, Yahoo, Nasdaq and more.Before joining NerdWallet, Ryan was a senior writer and principal researcher at Gartner. He is based in Fort Myers, Florida. See full bio.+  more Reviewed by Tony SteuerLife insurance expertTony SteuerLife insurance expert | Life InsuranceTony Steuer is a financial wellness advocate, podcaster and speaker, and the author of \"Questions and Answers on Life Insurance.\" His advice has been featured in media outlets including The New York Times, The Washington Post, Fast Company, Forbes and CNBC. He has a bachelor of science degree in finance from California State University and holds the following designations: Chartered Life Underwriter (CLU), Life and Disability Insurance Analyst (LA) and Certified Personal and Family Finance Educator (CPFFE).See full bio.At NerdWallet, our content goes through a rigorous editorial review process. We have such confidence in our accurate and useful content that we let outside experts inspect our work.+  more Edited by Katia IervasiAssistant Assigning Editor  Katia IervasiAssistant Assigning Editor | Life insurance, disability insurance, health careKatia Iervasi is an assistant assigning editor at NerdWallet. An insurance authority, she previously spent over six years covering insurance topics as a writer, where she loved untangling complicated topics and answering readers’ burning money questions. She holds a Bachelor of Arts in communication and has studied writing, fact-checking and editing with Poynter. Her writing and analysis has been featured in The Washington Post, Forbes, Yahoo, Entrepreneur, Best Company and FT Advisor. Originally from Sydney, Australia, Katia currently lives in New York City. See full bio.Fact Checked+  more Life insurance is there to help reduce the financial burden on your loved ones when the inevitable happens. But every life insurance policy is different. Whether you want to make sure your spouse can continue paying the bills if you die unexpectedly or you simply want to cover your own funeral costs, the best type of life insurance ultimately comes down to your needs and budget.Learn more about the different types of life insurance to determine which one might be right for you:Term life insuranceWhole life insuranceUniversal life insuranceVariable life insuranceBurial insuranceOther types of life insurance» MORE: Term vs. whole life insurance: Differences, pros and consKey terms in this articleBeneficiaryThe person(s) or entity that receives the death benefit when the insured person dies.Cash valueA component of a permanent life insurance policy that grows over time and allows you to make withdrawals, borrow against it and more.Death benefitThe amount of money the life insurance company pays a beneficiary after the insured person dies.Permanent life insuranceA type of life insurance that usually lasts a lifetime and includes a cash value component.PremiumThe cost of maintaining a life insurance policy.Term life insuranceA life insurance policy that lasts for only a set number of years.» MORE: Essential life insurance definitions and termsDifferent types of life insuranceThese are the most basic types of life insurance on the market and what each covers.Types of life insuranceCoverage lengthBuilds cash value?Death benefitTermTemporary — typically 10, 20 or 30 years.No.Fixed.WholeLifetime.Yes.Fixed.UniversalLifetime.Yes.Flexible.VariableLifetime.Yes.Flexible.BurialLifetime.Yes.Fixed.Term life insuranceBest for: Most people. Term life insurance is a simple, low-cost policy, and its main purpose is to replace your income when you die.How it works: Term life insurance is typically sold in lengths of one, five, 10, 15, 20, 25 or 30 years. Coverage amounts vary depending on the policy but can go into the millions. Most people buy term life insurance for a length long enough to cover their prime working years. That way, if they die early, they can help a surviving spouse or other beneficiary meet short-term financial needs like paying off a mortgage or supporting their kids through college.Pros: It’s often the cheapest life insurance, and it's sufficient for most people.Cons: If you outlive your policy, your beneficiaries won’t receive a payout.Learn about the best term life insurance companiesThese carriers topped our list of the best term life insurance companies in 2024.InsurerNerdWallet ratingGuardian5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.MassMutual5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Northwestern Mutual5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.New York Life5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Pacific Life5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.State Farm5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.USAA4.5NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.NerdWallet rates insurers at the company level, not the policy level. This means our star rating reflects the company as a whole, and not its term life insurance policies specifically.» MORE: Term life insurance: What it is and how it works↑ Back to topWhole life insuranceBest for: Those who want a straightforward permanent policy and can afford the higher premiums.How it works: Whole life insurance typically lasts your entire life, as long as you keep up with premiums. It’s the closest thing to “set it and forget it” life insurance you’ll find. In general, your premiums stay the same, you get a guaranteed rate of return on the policy’s cash value, and the death benefit amount doesn’t change.Pros: It usually covers you for your entire life, builds cash value and is relatively simple compared with other permanent life insurance options.Cons: It’s typically more expensive than term life, so if you're looking for affordable life insurance, you might want to explore other options.Learn about the best whole life insurance companiesWhole life insurance is a lengthy financial commitment, so you want to compare your options. These are NerdWallet's best whole life insurance companies in 2024.InsurerNerdWallet ratingGuardian5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.MassMutual5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Northwestern Mutual5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.New York Life5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.State Farm5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.NerdWallet rates insurers at the company level, not the policy level. This means our star rating reflects the company as a whole, and not its whole life insurance policies specifically.» MORE: Whole life insurance: What it is and how it works↑ Back to topUniversal life insuranceBest for: People who want permanent life insurance that can flex to future needs.How it works: A few policies fall under the universal life insurance umbrellas. But generally, this type of coverage allows you to adjust your premiums (within limits) and has a cash value component that grows based on market interest rates. Premiums typically increase over time, forcing you to increase your premium payments or cover rising costs by subtracting from your cash value account or death benefit. Universal life insurance is different from indexed universal life insurance — with those policies, the cash value growth is tied to a stock or bond index like the S&P 500.Pros: It’s typically less expensive than whole life insurance and can adapt to your needs as life changes.Cons: The death benefit and cash value growth are not guaranteed.» MORE: What is universal life insurance? Pros, cons and cost↑ Back to topVariable life insuranceBest for: Those with a higher risk tolerance who want greater control over their cash value investments.How it works: This type of cash value life insurance is tied to investment accounts, such as bonds and mutual funds. Variable life insurance premiums are typically fixed and the death benefit is guaranteed, regardless of how the market fares. If you’re considering a policy like this, a fee-only financial advisor — a planner who doesn’t earn commissions based on product sales — can help you choose the best one.Pros: There is potential for considerable gains if your investment choices do well.Cons: It requires you to be hands-on in managing your policy because the cash value can change daily based on the market.🤓Nerdy TipSome insurers offer a hybrid policy known as variable universal life insurance. This has similar features to variable life insurance, except the premiums are adjustable — which may suit those who don’t want to commit to paying the same amount in premiums each month.» MORE: A guide to variable life and variable universal life insurance↑ Back to topBurial insurance or final expense insuranceBest for: People who want to cover their own funeral, burial and other end-of-life expenses.How it works: Also known as final expense insurance, burial insurance is a small whole life insurance policy that is meant to help your family pay for your funeral, burial and other expenses after your death, like outstanding medical bills. The death benefit is guaranteed and typically ranges from $5,000 to $25,000.Pros: A medical exam isn’t typically required, making it more accessible to seniors with pre-existing health conditions.Cons: Coverage is capped at low amounts. If you die within two or three years of taking out your policy, your insurer may not pay the full death benefit.Learn about the best burial insurance companiesThese insurers made our list of the best burial insurance companies in 2024.InsurerNerdWallet ratingAge eligibilityState Farm5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Issue age: 45 to 80 (50 to 75 in NY).AARP/New York Life5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Issue age: 50 to 80 (50 to 75 in NY).American Family4.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Issue age: 50 to 80.Ethos3.5NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Issue age: 65 to 85.Mutual of Omaha3.5NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Issue age: 45 to 85 (50 to 75 in NY).NerdWallet rates insurers at the company level, not the policy level. This means our star rating reflects the company as a whole, and not its burial insurance policy specifically.» MORE: How to use burial insurance to pay for final expenses↑ Back to topOther types of life insuranceGroup life insurance is typically offered by employers as part of the company’s workplace benefits. Premiums are based on the group as a whole rather than each individual. In general, employers offer basic coverage for free, with the option to purchase supplemental life insurance if you need more coverage.Mortgage life insurance covers the current balance of your mortgage and pays out to the lender, not your family, if you die.Credit life insurance pays the balance of a specific loan, like a home equity loan. Your bank might offer to sell you a credit life insurance policy when you take out a loan. If you die, the policy pays off the lender, not your family.Accidental death and dismemberment insurance covers you if you die in an accident, such as a car crash. AD&D insurance also pays out for the loss of limbs as well as the loss of your sight or hearing — but it’s typically offered only through the workplace.Joint life insurance insures two lives, usually those of spouses, under one policy:First-to-die: Pays out after the first policyholder dies. The policy would then expire; it doesn’t continue to cover the second person. These policies are extremely rare because the demand for them is low.Second-to-die: Pays out after both policyholders die. These policies can be used to cover estate taxes or the care of a dependent after both policyholders die.» MORE: Compare life insurance quotes↑ Back to topFind the right life insurance plan for youMake sure you and your loved ones are covered - compare customized life insurance quotes from our partners.Compare with PolicygeniusDifferent types of life insurance by underwritingUnderwriting refers to how a life insurance company calculates the risks of insuring you. A policy’s underwriting determines a few things, like how quickly your coverage will go in force, whether you’ll need to take a medical exam and the price you’ll pay.There are three main types of life insurance underwriting:Fully underwritten life insuranceIf you're healthy, fully underwritten policies will generally be the cheapest option.This is because the life insurance application process typically includes a medical exam and questions about your health as well as questions about your family’s health history, your hobbies and your travel plans.Insurers use this data to price the policy more accurately based on your specific life expectancy. To get the most favorable rate, aim to provide as much information as possible when filling out your application.Simplified issue life insuranceSimplified issue policies don’t require you to take a medical exam. However, you may be asked a few health questions and could be turned down based on your answers.Instant-approval life insurance policies use quick, online health questionnaires as well as algorithms and big data to speed up the application process.Guaranteed issue life insuranceGuaranteed issue life insurance requires no medical exams and no health questions. In short, you can’t be turned down for coverage if you’re within the eligible age range, which is typically 40 to 85. However, this is an expensive way to buy life insurance, and coverage amounts are generally low.In addition, these policies have graded death benefits, which means if you die within the first few years of having the policy, your beneficiaries may receive only a partial payout. People often buy this type of life insurance if they’ve been turned down elsewhere because of their health but they want to cover final expenses, such as funeral costs.Which type of life insurance should you get?Still not sure which type of life insurance is right for you? Use this tool to help you figure out if you even need life insurance, and if so, which type of policy might be best.The best life insurance companies in November 2024The best life insurance companies stand out for their financial strength and coverage options. Our list for 2024 includes some of the largest life insurance companies in the U.S., as well as smaller, online-only insurers.InsurerNerdWallet ratingPolicies offeredMassMutual5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Term, whole, universal and variable universal.Guardian5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Term, whole, universal and variable universal.Northwestern Mutual5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Term, whole, universal and variable universal.New York Life5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Term, whole, universal and variable universal.Pacific Life5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Term, universal, variable universal and indexed universal.State Farm5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Term, whole and universal.AARP5.0NerdWallet rating NerdWallet's ratings are determined by our editorial team. The scoring formula incorporates consumer experience, financial strength ratings and complaint data.Term, whole and guaranteed issue whole life.Frequently asked questionsHow much does life insurance cost?The average cost of life insurance is $26 a month, according to Covr Financial Technologies. To get this figure, we looked at a healthy 40-year-old buying a 20-year, $500,000 term life insurance policy. Rates vary among insurers, so be sure to compare life insurance quotes to get the best possible price.Do I need life insurance?If you have dependents relying on your income, you might need life insurance. The payout from your policy could ease the financial burden on your loved ones if you were to die unexpectedly.What's the best type of life insurance to get?The best life insurance policy for you comes down to your needs and budget. For most people, term life insurance is sufficient and the cheapest type of coverage. It lasts a set period and provides a guaranteed payout if you die during that term.Which types of life insurance generate cash value?Cash value grows in permanent life insurance policies, including whole, universal, and variable life insurance. Once enough cash value has accumulated, you can borrow against your policy, withdraw the cash or use it to pay premiums.Which types of life insurance offer flexible premiums?You can adjust your premiums with universal life and variable universal life insurance. Your policy will be issued with a set premium, and you can pay more or less or skip premiums by contacting your insurer. With term and whole life insurance, premiums are typically fixed, making your payments predictable.How much does life insurance cost?The average cost of life insurance is $26 a month, according to Covr Financial Technologies. To get this figure, we looked at a healthy 40-year-old buying a 20-year, $500,000 term life insurance policy. Rates vary among insurers, so be sure to compare life insurance quotes to get the best possible price.Do I need life insurance?If you have dependents relying on your income, you might need life insurance. The payout from your policy could ease the financial burden on your loved ones if you were to die unexpectedly.What's the best type of life insurance to get?The best life insurance policy for you comes down to your needs and budget. For most people, term life insurance is sufficient and the cheapest type of coverage. It lasts a set period and provides a guaranteed payout if you die during that term.Which types of life insurance generate cash value?Cash value grows in permanent life insurance policies, including whole, universal, and variable life insurance. Once enough cash value has accumulated, you can borrow against your policy, withdraw the cash or use it to pay premiums.Which types of life insurance offer flexible premiums?You can adjust your premiums with universal life and variable universal life insurance. Your policy will be issued with a set premium, and you can pay more or less or skip premiums by contacting your insurer. With term and whole life insurance, premiums are typically fixed, making your payments predictable.About the authorRyan BradyRyan Brady is a lead writer on the small-business team at NerdWallet and authority on small-business lending. See full bio.ON THIS PAGEMORE LIKE THISLife insurance providersLife insurance policy typesManaging life insuranceBuying life insuranceInsuranceLife InsuranceCompare Life Insurance Quotesby Georgia RoseRead moreLife Insurance Policies and Quotes for November 2024by Georgia RoseA life insurance policy pays out a sum of money to your beneficiaries after you die.Read more7 Best Term Life Insurance Companies in November 2024by Georgia RoseGuardian and MassMutual top our list of the best term life insurance companies in 2024.Read moreGet more smart money moves – straight to your inboxSign up and we’ll send you Nerdy articles about the money topics that matter most to you along with other ways to help you get more from your money.Sign up\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   Finance Smarter  about   Company   Leadership   Careers   Corporate impact   Diversity & Inclusion   Editorial guidelines   Star rating methodologies   Editorial team   News   Press kit   Investors    help   Help center   Support team   Community   Security FAQs    legal   Terms of use   Supplier Code of Conduct   Privacy policy   California privacy policy   Privacy preferences   Do not sell or share my personal information    Learn more about the app   Download the app             Disclaimer: \nNerdWallet strives to keep its information accurate and up to date.\n            This information may be different than what you see when you visit a\n            financial institution, service provider or specific product's\n            site. All financial products, shopping products and services are\n            presented without warranty. When evaluating offers, please review\n            the financial institution's Terms and Conditions. Pre-qualified\n            offers are not binding. If you find discrepancies with your credit\n            score or information from your credit report, please contact\n            TransUnion® directly.\n  \nNerdUp by NerdWallet credit card: NerdWallet is not a bank. Bank\n        services provided by Evolve Bank & Trust, member FDIC. The NerdUp by\n        NerdWallet Credit Card is issued by Evolve Bank & Trust pursuant to a\n        license from MasterCard International Inc.\n \nImpact on your credit may vary, as credit scores are independently\n        determined by credit bureaus based on a number of factors including the\n        financial decisions you make with other financial services\n        organizations.\n  \nNerdWallet Compare, Inc. NMLS ID# 1617539   \nNMLS Consumer Access\n\n|\n\nLicenses and Disclosures\n  \nCalifornia: California Finance Lender loans arranged pursuant to\n            Department of Financial Protection and Innovation Finance Lenders\n            License #60DBO-74812\n \nInsurance Services offered through NerdWallet Insurance Services,\n            Inc. (CA resident license no.OK92033)  \n\nInsurance Licenses\n    \nNerdWallet has an engagement with Atomic Invest, LLC (“Atomic\n            Invest”), an SEC-registered investment adviser, to bring you the\n            opportunity to open an investment advisory account (“Atomic Treasury\n            account”). Investment advisory services are provided by Atomic\n            Invest. Companies which are engaged by Atomic Invest receive\n            compensation of 0% to 0.85% annualized, payable monthly, based upon\n            assets under management for each referred client who establishes an\n            account with Atomic Invest (i.e., exact payment will differ). Atomic\n            Invest also shares a percentage of compensation received from margin\n            interest and free cash interest earned by customers with NerdWallet.\n            NerdWallet is not a client of Atomic Invest, but our engagement with\n            Atomic invest gives us an incentive to refer you to Atomic Invest\n            instead of another investment adviser. This conflict of interest\n            affects our ability to provide you with unbiased, objective\n            information about the services of Atomic Invest. This could mean\n            that the services of another investment adviser with whom we are not\n            engaged could be more appropriate for you than Atomic Invest.\n            Advisory services through Atomic Invest are designed to assist\n            clients in achieving a favorable outcome in their investment\n            portfolio. They are not intended to provide tax advice or financial\n            planning with respect to every aspect of a client’s financial\n            situation and do not include investments that clients may hold\n            outside of Atomic Invest. For more details about Atomic Invest,\n            please see the Form CRS, Form ADV Part 2A, the Privacy Policy, and other disclosures.\n   \nBrokerage services for Atomic Invest are provided by Atomic\n            Brokerage LLC, a registered broker-dealer and member of FINRA and\nSIPC and an affiliate\n            of Atomic Invest. Due to the relationship between Atomic Brokerage and\n            Atomic Invest, there is a conflict of interest due to Atomic Invest directing\n            orders to Atomic Brokerage. For additional information regarding conflicts,\n            please see Items 5, 12 and 14 of Atomic Invest's Form ADV Part 2A. For more details about Atomic Brokerage, please see the Form CRS, the Atomic Brokerage General Disclosures, and the Privacy Policy. Check the background of Atomic Brokerage on FINRA's BrokerCheck. Fees such as regulatory fees, transaction fees, fund expenses,\n            brokerage commissions and services fees may apply to your brokerage\n            account.\n   \nNeither Atomic Invest nor Atomic Brokerage, nor any of their\n            affiliates is a bank. Investments in securities are Not FDIC insured, Not Bank\n                Guaranteed, and May Lose Value. Investing involves risk, including the possible loss of\n            principal. Before investing, consider your investment objectives and\n            the fees and expenses charged. Custodial and clearing services used\n            by Atomic Brokerage can be found on its BrokerCheck report. Technology services may be provided by AtomicVest, Inc.\n  \nNerdWallet™ | 55 Hawthorne St. - 10th Floor, San Francisco, CA 94105\n     \nNerdWallet USA\n |  \nNerdWallet UK\n \n|\n  \nNerdWallet CA\n \n|\n  \nNerdWallet AU\n    \nNerdWallet CA\n |  \nNerdWallet AU\n   \n© 2024 NerdWallet, Inc. All Rights Reserved.                             \n\n"
    },
    {
        "link": "https://www.oid.ok.gov/consumers/insurance-basics/life-insurance/",
        "raw_text": "\n403 Forbidden\n\n403 Forbidden\nnginx\n\n\n"
    },
    {
        "link": "https://www.insurance.ca.gov/01-consumers/105-type/95-guides/07-life/life-ins-guide.cfm",
        "raw_text": "  \n\n \n\n\n\n\nLife Insurance Guide  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to Main Content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nSearch this site: \n\n \n \n\n\n\n\n\n\n\n\n\n\n \nFile a Complaint\nConsumers\n\n\nFile a Complaint\nAsk a question or file a complaint\n\nCheck License Status\nCheck License Status\n\nTypes of Insurance\nUnderstand different types of insurance\n\nHealth Insurance Information\nLearn about health insurance\n\nCompany and Agent/Broker Information\nFind information about insurance companies, agents and brokers\n\n\n\nLaws & Regulations\nSearch insurance laws and regulations\n\nVirtual Viewing Room\nThis virtual viewing room allows you to see insurance company rate filings, examination reports, and related information.\n\nDealing with Catastrophes\nPrepare for natural disasters\n\nAdministrative Hearings and Public Programs\nLearn about administrative hearings and other public programs\n\nCannabis and Insurance\nFind out more about Cannabis and Insurance.\n\n\n\nBail Bonds\nLearn more about surety bail bonds\n\nClimate Change\nClimate Change and Insurance\n\nInformation Guides\nInformation Guides\n\nWildfire Response and Readiness\nWildfire Response and Readiness\n\n\n\n\n\nSeniors\n\n\nAlerts\nReview important Alerts, Advisories & Press Releases that impact Seniors.\n\nBefore You Buy Insurance\nThings you should know before you buy insurance.\n\nHealth Coverage\nHealth plans are important for Seniors. Please review this important information.\n\n\n\nLong Term Care\nFind out if Long Term Care insurance is something for you.\n\nInformation Guides\nRead information guides specifically designed for seniors.\n\nOther Resources\nWe are providing additional information that you may find helpful.\n\n\n\n\n\nAgents & Brokers\n\n\nCheck a License\nSearch for license status information based on license number or name.\n\nProducer Online Services\nConvenience & Security at your Fingertips: Apply for an Insurance License, Schedule Examination, License Renewal, Change Your Address, and more.\n\nApplying for a License\nHow to apply for a license for individual resident license, individual non-resident license, and business entity licenses.\n\nSeeking Prelicensing / Continuing Education\nPrelicensing and continuing education is required by law. Find how and where to get prelicensing and continuing education in this section.\n\nProducer Background Information\nInformation relating to licensing, background issues and information for producer license applicants regarding Proposition 64, the “Adult Use of Marijuana Act”.\n\nCheck License Application Status Service (CLASS)\nCheck License Application Status Service (CLASS)\n\n\n\nProducer Licensing Forms\nList of necessary qualifications, requirements, fees and interactive forms for producer licensing. Plus prelicensing/continuing education forms.\n\nProducer Licensing Fees\nProducer Licensing Fees\n\nResident License Renewal\nAll you need to know about renewing your license.\n\nNon-Resident License Renewal\nAll you need to know about renewing your non-resident license.\n\nPrint or Download Your License\nPrint or download license\n\nUpdating Licensee Info\nReport a change of address, email address, add an endorsee to a business entity, and producer licensing background review guidelines.\n\n\n\nProducer Licensing Frequently Asked Questions\nProducer Licensing Frequently Asked Questions\n\nApplying to Become an Approved Education Provider\nEducation provider on-line programs to assist education providers in processing rosters and class schedules and in filing for provider status, course approval, and course development.\n\nAgent & Broker ALERT\nAgent & Broker ALERT Provided by California Insurance Commissioner's office\n\nWhat’s New in the Licensing Services Division\nMajor changes in the Licensing Services Division since 2010 including regulations, programs, fees, etc.\n\nLicensing Services Division Notices\nLicensing Services Division Notices since 2010.\n\nProducer Mailing Lists\nMailing lists for active individuals, agencies, and insurance companies and order forms.\n\n\n\n\n\nInsurers\n\n\nInsurers\nInsurers Applications, Forms and Filings, Bulletins & Notices, Programs, Officially Filed Reports of Examination\n\nElectronic Funds Transfer (EFT) Programs\nConvenient method for the payment of Invoices and Premium Tax remittances. Separate enrollment is required for the Invoice Payments EFT Program and Tax EFT Program.\n\nOASIS\nOnline Assistance System for Insurer Submittals (OASIS)\n\nLegal Information\nInsurance Code and Regulations, Proposed Regulations, Decisions and Rulings, Hearing Calendar.\n\n\n\nData & Reports\nMarket Share Reports, Consumer Complaint Study,Residential and Commercial Earthquake Insurance Coverage Study, Annual Report of the Commissioner, and More.\n\nCOIN\nCalifornia Organized Investment Network (COIN) Is a Collaborative Effort Between the California Department of Insurance, the Insurance Industry, Community Affordable Housing and Economic Development Organizations, and Community Advocates.\n\nInsurance Diversity Initiative\nIDI is an effort to encourage Supplier Diversity and Governing Board Diversity within California’s insurance industry\n\nP&C Rate Filing\nPrior Approval Regulations, Workers' Compensation Rate Filings, Public Notices of Rate Filings.\n\n\n\nCRC\nCompany Complaint Response Center\n\nLRS\nAuto Body Repair Labor Rate Survey Tool\n\n\n\nClimate Risk Carbon Initiative\nInteractive database that provides information on insurers' investments in fossil fuel\n\nClimate Risk Disclosure Survey\nView the Climate Risk Disclosure Survey Results\n\n\n\n\n\nFraud\n\n\nFraud Division Overview\nThe Fraud Division investigates suspected fraud committed by consumers or organized criminal elements perpetrated against insurance companies.\n\nInvestigation Division Overview\nThe Investigation Division investigates suspected fraud committed by insurance agents, brokers, public adjusters, bail agents, insurance companies and other individuals and entities transacting the business of insurance who perpetrate fraud against consumers.\n\n\n\nFile a Commendation or Complaint\nProfessional Standards Unit Civilian Commendation/Complaint Forms\n\nReport Fraud\nLink to CDI’s two suspected insurance fraud reporting systems – 1) Insurance Company Suspected Fraud Reporting Portal and, 2) Consumer Suspected Fraud Reporting Portal.\n\n\n\nInsurance Fraud Grant Programs\nInsurance Fraud Grant Programs\n\n\n\n\n\nNews\n\n\nPress Releases\nOfficial announcements, news releases. \n\nAdvisories\nAdvising media events and activities\n\nCA Consumer Alerts\nCA Consumer Alerts\n\n\n\nConsumer Success Stories\nConsumer success stories\n\nFeatured Topics\nProvides links to featured topics\n\nStudies, Reports & Publications\nMarket share reports, consumer complaint study, residential and commercial earthquake insurance coverage study, annual report of the commissioner, and more.\n\n\n\nMultimedia\nVideo press conferences, public service announcements, hearings and public forums\n\n\n\n\n\nAbout Us\n\n\nMeeting Requests\nScheduling an appointment with Commissioner Lara\n\nAbout the Commissioner\nInformation about the Commissioner\n\nAbout the Department\nInformation about the Department's history and organization\n\n\n\nCommissioner Appointments\nInformation about the Commissioner's  Appointments to Boards and Committees\n\nCareer Opportunities\nEmployment opportunities within the Department of Insurance\n\nContact Us\nContact information for offices and entities\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nConsumers\n/\nTypes of Insurance\n/\nInformation Guides\n/\nLife Series\n/ Life Insurance Guide\n\n\nLife Insurance Guide\n(Revised March 2018)\n \n\nTable of Contents\n\nIntroduction to Life Insurance and Annuities\nDefining Your Needs\n\nLife Insurance\n\nChoosing the Amount of Life Insurance\nSteps to Determine How Much Life Insurance You Need\nChoosing the Appropriate Type of Life Insurance\nImportant Facts if You Are Considering Changes to Your Life Insurance Policy\n\nAnnuities\n\nDeferred Annuities\nChoosing the Type of Deferred Annuity\nFinding a Good Buy\n\nOther Useful Information\n\nSuitability\nAgents\nReliability and Stability of Companies\nInformation Sources\nThe California Insurance Code and Code of Regulations\nBeware of Any Agent Who…\nShopping Tips\nGlossary of TermsHighlights in Spanish \nTalk to Us\n\n\nIntroduction to Life Insurance and Annuities\nIf you are planning to purchase a life insurance policy or an annuity contract, you should first consider your needs and understand the different type of insurance products that are available.  Many more consumers are using life and annuity products as part of their financial planning goals.  Consumers spend substantial sums of money each year on life insurance policies or annuity contracts knowing very little about what it is that they are getting.  This guide was developed to help consumers make educated decisions and to help them understand both the benefits and the risks involved in financial planning.\nThe purpose of this information guide is to help you understand what type of life insurance policies or annuity contracts are available.  If one type of policy or contract does not fit your needs, then ask and find out about other available policies or contracts, many of which are described in this information guide.  You can research more information on life insurance policies or annuity contracts by checking with a licensed life insurance agent or a licensed life insurance company.  You can also visit your public library for  material or books on financial planning.  Life insurance or annuity information is also available on the Internet.  In addition, The California Department of Insurance (CDI) has a toll-free Hotline telephone number and website that can provide further information and assistance on life insurance policies and annuity contracts.  Please see the many ways to contact the CDI on the last page of this information guide.  This information guide is divided into two sections:  Life Insurance and Annuities.  \nBack to Top\nDefining Your Needs\nThe purchase of life insurance is an important decision for both you and your family.  There are many reasons why life insurance policies or annuity contracts are purchased, but these reasons should be based upon your financial planning needs.  Factors such as your marital status, number of dependents and cost for their support, future education needs, current and anticipated family income, and your current assets and debt obligations all play a role in determining the amount of life insurance that is right for you. \nLife Insurance\nChoosing the Amount of Life Insurance\nYour need for life insurance will vary with your age and responsibilities. The amount of insurance you buy should depend on the standard of living you wish to assure for your dependents. You should consider the amount of assets and sources of continuing income available to your dependents when you pass away. Simply stated, you should choose an amount of life insurance that is determined necessary to meet the needs you are trying to satisfy.  A balance needs to be achieved in this process.  To be over-insured can negatively affect your budget and threaten your long range financial goals just as much as being under-insured can. While each person must individually assess their responsibilities, needs, and financial situation, it is important to be careful to choose an amount of life insurance that reflects your specific circumstances without under-insuring or over-insuring.\nSteps To Determine How Much Life Insurance You Need:\n\n Determine how much life insurance you need based on the factors mentioned above.        Decide how much money you can afford to pay.       Choose the type of life insurance policy that meets your coverage goals and current family budget. Fitting these two factors together will move  you toward a successful overall financial plan.\n\n Once you have completed these steps, you will be able to move ahead and contact several life insurance companies (through an agent or broker) to shop for the right type of policy for you.  There are many reasons for purchasing life insurance, among which are the following:\n\nInsurance to provide financial protection and security for surviving family members upon the death of the insured person. Insurance to cover a particular need such as paying off a mortgage or other debt upon the insured's death. Business insurance to compensate a company on the death of a key employee or to provide a surviving partner the resources to buy out the deceased partner's share of the business. Insurance to provide funds to pay estate taxes or other final obligations necessary to settle a deceased person's estate. Insurance to provide the funds necessary for the deceased person's burial expenses.\n\nBack to Top\nChoosing the Appropriate Type of Life Insurance\n There are two basic types of life insurance: Term Life Insurance and Cash Value Life Insurance.  There are many policy variations between these two types of life insurance.  Term Policies provide life insurance for a specified period of time.  This period could be as short as one year or provide coverage for a specific number of years such as 5, 10, 20 years or to a specified age.  If you die during the term period, the company will pay the face value to your beneficiary.  If you live beyond the term period you had selected, no benefit is payable. As a rule, term policies offer a death benefit with no savings element or cash value.  If you have a limited amount to spend, and only need insurance for a specified period of time, you may be able to get more coverage by buying term insurance than by buying cash value insurance. Keep in mind that the cost of term insurance increases as you get older, which may make it more expensive than cash value insurance in the long run.   Today’s term policies usually have two sets of premiums: guaranteed maximum premiums and current premiums.  Current premiums are usually much lower, but they can be changed by the insurance company.  The insurance company cannot increase the current premium above the guaranteed maximum premiums shown in the policy.When you buy term insurance, you need to make a choice as to how long you want the protection.  You may renew the policy without a physical examination for the period of years specified in the policy.  Some term insurance can be converted to cash value insurance up to a specified age with no physical examination.  Premiums for the converted insurance will most likely be higher than the premiums you would be paying for the term insurance.  If you do not pay the premium for your term insurance, it will generally lapse without cash value, as compared to a permanent type of policy that has a cash value component. \nCash Value Insurance combines death benefits with a cash value accumulation feature. The buyer of a cash value policy pays more in the early years than for term insurance, but the premium not needed to pay for the cost of the death benefit accumulates with interest within the policy. If the policy is surrendered before the insured person dies, there may be a cash value paid to the owner, less any outstanding loans placed against the policy.\nMake sure the agent/broker provides you with the method by which the cash value is determined and that they obtain this information based on the policy's guaranteed value. It is not a good idea to buy a cash value life insurance policy if you plan to surrender early due to substantial surrender penalties. If all premiums are paid, cash value insurance usually lasts for the entire life of a person and pays death benefits to the beneficiaries named in the policy upon the death of the insured. The cash value can be used as loan collateral for borrowing funds at the interest rate specified in the policy. Any outstanding loans are deducted from policy proceeds at death or at policy surrender.\nSome of these products may enjoy tax advantages while they remain active. Therefore, a policy lapse or surrender may create a taxable event and may generate a Form 1099. Form 1099s are sent to the IRS for tax purposes; be sure to check with your tax advisor. Some of the most popular types of cash value insurance are described below:\nBack to Top\n\nWhole Life Insurance (also known as straight life, ordinary life, and traditional permanent insurance) is designed to provide coverage for your entire lifetime unlike term insurance which provides protection for a specified time period.  To keep the premium level, the premium at the younger ages exceed the actual cost of protection.  This extra premium builds a reserve (cash value) which helps pay for the policy in later years as the cost of protection rises above the premium.  Whole life policies stretch the cost of insurance over a longer period of time in order to level out the otherwise increasing cost of insurance.  Under some policies, premiums are required to be paid for a set number of years.  Under other policies, premiums are paid throughout the policyholder's lifetime. \nUniversal Life Insurance  is the most flexible of all the various kinds of policies because it treats the elements of the policy separately; universal life allows you to change or skip premium payments or change the death benefit more easily than any other policy.  It works by treating the three elements of the policy — premium, death benefit, and cash value — separately. Cash values are accumulated by crediting premium payments and interest to a fund from which deductions are made for expenses and cost of insurance.  Interest rates are linked to an external index such as Treasury bills.  Because the cash value element of this type of policy is interest-rate sensitive, predictions of future costs are highly dependent upon the accuracy of interest rate projections.  The policy can also be structured to operate like term insurance.\nVariable Life Insurance has a death benefit that varies in relation to the investment experience of the assets underlying the policy.  A higher rate of return on the invested fund will cause the death benefits to increase, while a low or negative rate will cause the death benefits to decrease.\nVariable Universal Life Insurance Insurance combines the flexibility of universal life insurance with the investment account features of variable life insurance.  Back to Top\nVarious type of Life Insurance policies\n\n\n\nType of Policy\nPremium\nFace Amount\nCash Value\nPolicy Loans\n\n\nTerm\nLow; but increase w/age\nRenewable into old age\nNone\nNo\n\n\nWhole\nLevel\nLevel; can't be changed\nYes; no ability to choose investments\nYes\n\n\nUniveral\nFlexible\nLevel; can vary\nYes; no ability to choose investment\nYes\n\n\nVariable\nLevel\nLevel; Can't be changed\nYes; abililty to choose investments\nYes\n\n\nVariable Universal\nFlexible\nLevel; can vary\nYes; ability to choose investments\nYes\n\n\n\nGroup Insurance\nMany employers offer life insurance under a group plan and sometimes pay part or all of the premium.  A medical exam is usually not required for insurance purchased this way, and the insurance can be less expensive than coverage purchased as an individual.  Under California law, group life insurance must be convertible to permanent insurance at the insured's option when the insured's coverage under the group policy terminates.  The converted policy will probably be much more expensive than the group insurance.  Some employers will allow insurance companies to send agents or enrollers to their premises in order to offer insurance to their employees.  Policies offered in this manner are different from group insurance, and you should evaluate the materials shown to you in the same way as if you were considering a purchase of an individual policy through an agent.\nInsurance by Mail Order or Through the Internet\nSome insurance companies solicit by mail or through the Internet. In most cases, the prospective buyer mails a completed application directly to the company. Both Internet and mail order marketing may not provide a complete range of choices as target marketing often involves offering only one type of policy. Before you buy by mail or through the Internet, consSome insurance companies solicit by mail or through the internet.  In most cases, the prospective buyer mails a completed application directly to the company.  Both internet and mail order marketing may not provide a complete range of choices as target marketing often involves offering only one type of policy.  Before you buy by mail or through the internet, consult an expert who can help you determine the best policy for you.  You should verify that the insurance company offering the coverage is licensed to sell life insurance in California.ult an expert who can help you determine the best policy for you. You should verify that the insurance company offering the coverage is licensed to sell life insurance in California.\nSales Illustrations\nIt is likely that an agent will show you one or more life insurance sales illustrations.  An illustration consists of a series of numbers indicating how the policy works.  The illustration usually shows the guaranteed results under the policy for each year in the future, and the results if all the non-guaranteed items continue at their present level.  Actual results may be better or worse than the non-guaranteed amounts shown in the illustration (but not worse than those that are guaranteed).Using Indexes\nYour chances of finding a good buy on a life insurance policy is better if you use the index numbers that have been developed to aid you in shopping for life insurance.  The Buyer’s Guide that each insurer is required to provide to a purchaser explains these index numbers in detail.  They are good tools to help you compare the merits of similar policies. \nBack to Top\nImportant Facts If You Are Considering Changes to Your Life Insurance Policy\nMany consumers are approached by life insurance agents or life sales representatives and are asked to consider canceling their current life insurance policy in order to purchase a replacement policy.  In most cases, the cash value of the current life policy is used to buy more insurance or a new policy.  While a decision to replace an existing life insurance policy may be a good one, sometimes this may not be in your best interest.  More than likely you purchased your policy with a long term financial plan in mind.  Replacing or changing your insurance policy at this point may affect the intended results of your overall financial plan.  If you are considering replacing or changing your life insurance policy, you should first assess your needs and determine what is in your own long term best interest.  It is also important to consider the interests of those you are protecting.  Deciding how much insurance you need, how long it is needed, and which policy provides the best coverage is crucial to your financial security.Your financial needs should be thoroughly evaluated before changes are made in existing policies.  Any change in your personal circumstances since you first purchased life insurance may require a different strategy.  A comprehensive evaluation may indicate that replacing or changing your policy is advisable.  However, certain cautions are appropriate when considering replacing or changing your life insurance.  For example:\n\nYou may have to pay “start up” costs again.You may be required to wait one or two years before a new policy passes through the contestable period.  During the contestable period the insurer  is contractually entitled to cancel the policy or refuse to pay a claim based on omissions, or mistaken or untrue statements in your application. You may pay a higher premium for new insurance over the duration of the policy because you are older than when you first purchased life insurance.The financial strength of a new insurer may be different from that of your present insurer.  There may be specific tax consequences when you replace or change your current policy.You may find different loan provisions in a new policy, or you may find that you cannot take tax advantaged loans in the new policy.If you use the cash value of one policy to pay for the premium on a new policy, the values used may not be sufficient to support the new policy in future years, and may result in the need to make additional premium payments to keep the insurance in force.You may not have immediate access to your money in a new policy.  You may have to wait a considerable period of time, or pay a monetary penalty, to access the cash value in the policy.Tax consequences may occur if you take cash from an annuity or mutual fund that started as a replacement policy for your original life insurance policy. When considering policy replacement, it is important to note that you may have the ability to amend or convert your current policy to a newer     product within the same insurance company without any loss of rights or accumulated cash value.  It may be in your best interest to contact your current agent or company and to inform them of your intent.Illustrations are utilized by agents to highlight certain features of their policies.  Illustrations should never be the only factor used in deciding to replace  or change your policy. Illustrations that are presented for comparison purposes may not give a complete picture of the new policy’s future.  To ensure that your insurance policy meets your financial objectives, it is recommended that you obtain a second opinion, as well as consult with your current agent.  Given the complexities involved in counseling a consumer regarding insurance purchases, you may want to inquire about the professional qualifications of your current agent and new agent.   Back to Top\nAnnuities\nWhile life insurance proceeds are paid at the time of death of the insured, the proceeds of an annuity can provide you with an income for as long as you live. There are two types of annuities:\n\nThe first is when you pay a lump sum to a life insurance company, and they pay it out to you right away in periodic installments.  This type is known as an immediate annuity — the payments to you start immediately. The second, and more common, is where money paid by you accumulates with interest over a period of time.  If you choose, the accumulated amounts will then be paid out to you in periodic installments, usually when you retire, in order to supplement your retirement income.  This type is known as a deferred annuity — the payments to you are deferred for a number of years.  Currently, a deferred annuity may have tax advantages, in that the interest credited to your funds is deferred from current taxation.  That is to say, income tax is not owed until you start receiving distributions from the annuity.Both types of annuities offer you certain options for receiving your income.  It is usually paid to you monthly.  The most common options are:\nLife Annuity - The company will pay you an income for as long as you live.\nPeriod Certain Annuity - The company will pay you an income for a specified amount of time (5 years, 10 years, 20 years, etc.). \nLife Annuity with Period Certain -The company will pay you an income for as long as you live, but if you die before the period certain that you choose, the income will be paid to a survivor you designate until the end of that period.\nJoint and Survivor Annuity - The company will pay an income to you during your life, and after your death will pay a percentage of that income (50% or 75%, for example) to a survivor you designate during his or her life.  \nDeferred Annuities\nIn recent years, there has been an increasing emphasis on deferred annuities.  If you are going to make an informed choice when you buy a deferred annuity, you need to understand which kinds are available.  If one type does not seem to fit your needs, find out about the other contracts that are described in this guide.  If you need more information than is given here, you should check with a life insurance agent or company, or consult books on life insurance which are available at your public library.  Also, the California Department of Insurance (CDI) has a toll-free Hotline listed in this guide to assist you.\nBack to Top\nChoosing the Type of Deferred Annuity\nThere are two basic types of deferred annuities: fixed annuities and variable annuities. There are several variations on them.\nFixed Annuities guarantee that your money will accumulate at a minimum specified rate of interest.  However, the company will pay you a higher rate of interest if its investment experience is better than the minimum guarantee.\nVariable Annuitiesdiffer from fixed annuities in that contract owners direct the distribution of their money among several different accounts and their accumulated funds reflect the experience of those accounts rather than that of the company.  Typical account choices are common stock, bond, mortgage or money-market accounts.  If the value of the accounts increases or decreases, so will the amount accumulated. Variable annuities are more risky to the contract owner than fixed annuities, but there is a possibility of greater returns. Other types of deferred annuities combine the characteristics of fixed and variable annuities. Annuities are sometimes sold as alternatives to investment vehicles such as certificates of deposit, money market accounts, mutual funds, etc.  There are differences between these products. If you die during the surrender charge period, the surrender charges are deducted from the amount the beneficiary receives.  You should consult with your investment and/or tax advisor before making any decisions on purchasing this product.If you die during the accumulation phase of a deferred annuity, an amount usually at least equal to the amount you have accumulated will be paid to your beneficiary.  If you cancel the contract, or take some money out of it, there may be surrender charges deducted from the accumulation value.  The amount you receive is usually referred to as the cash value.  It is usually not a good idea to purchase a deferred annuity unless you are planning to keep it for more than just a few years.\nBanks and Brokerage Firms\nProducts developed by life insurance companies are sometimes marketed through banks and brokerage firms.  The person who sells you a life insurance policy or annuity should be a licensed life insurance agent, and in the case of a variable annuity, a licensed securities dealer.  If you purchase an annuity through these sources, you should ask for the name of the insurance company, since they are the ones who will be managing your money. life insurance agent, and in the case of a variable annuity, a licensed securities dealer. If you purchase an annuity through these sources, you should ask for the name of the insurance company, since they are the ones who will be managing your money.\nFinding a Good Buy\nGuarantees\nA fixed deferred annuity always contain guarantees.  For example, it might guarantee that the interest rate on the funds accumulating in your policy will be at least 2%.  The guarantees are conservative, so that the company will be able to pay you the guaranteed amounts, even if conditions are very bad.  Today, most companies pay greater amounts than they guarantee, but do not promise to continue to do that indefinitely.  If you are shown any tables of numbers illustrating how the annuity might grow in the future, you should keep in mind that the non-guaranteed numbers could turn out to be lower or higher than those shown.You should also ask questions about the amounts you will receive if you decide to surrender your annuity, and find out the difference between the accumulation value and the amount you will receive.  It is important to make sure that you receive all guarantees in writing for both life insurance and annuities. \nBack to Top\nOther Useful Information\nSuitability\nOnly buy an annuity if it is suitable for your circumstances. Consider your purpose in purchasing an annuity and whether an annuity is the best vehicle for achieving your financial goals. Make sure you are buying an annuity that fits your goals and circumstances.You should consider:The extent to which purchasing an annuity will tie up your money and whether you will need to pay surrender charges to access sufficient funds to pay for living expenses, including emergencies which may arise in the future;Your age; income; liquidity needs; financial time horizon; intended use of the annuity; The extent  to which the annuity allows you access to your money in the future without your having to pay surrender charges or other penalties;The values, benefits, and costs of your existing investments as compared to those of the recommended annuity contract. The law requires insurance agents to ask you questions about your financial situation to make sure the annuity you are purchasing is suitable for your needs and circumstances. Insurance companies and insurance agents are prohibited from selling you an annuity unless there is a reasonable basis to believe the annuity is suitable based on the information you provide to the agent. \nAgents\nLife insurance agents are licensed by the State, and may represent one or more companies.  If you use an agent, choose carefully.  Agents earn a commission on your business, and should do more for you than just sell you a life insurance policy or annuity contract.  They should assess your individual needs, answer your insurance questions, and help you establish your goals. If you are considering the purchase of a variable annuity, the agent should have an insurance license and a registration with the Financial Industry Regulatory Authority (FINRA)to sell variable products, which are considered to be securities.  You should receive a prospectus describing the investment alternatives available to you.  \nReliability and Stability of Companies\n In the past, high-risk investment strategies have threatened the solvency of some companies and thus the safety of policy benefits.  Be sure to check out independent rating services’ rating of any life insurance company you are considering before purchasing a life insurance policy or annuity contract.  Also make sure that your life insurance company is licensed in California.  Owners of annuity contracts or life insurance policies issued by companies licensed in California may be partially protected by the California Life and Health Insurance Guarantee Association (CLHIGA) in the event of the failure of the insurer.  If you need further information on CLHIGA or California Insurance Code Section 1067.02 (c) that explains the monetary protection under CLHIGA, then contact the CDI via the methods provided on the last page of this brochure. \nBack to Top\nInformation Sources\nAdditional information about life insurance companies can be found by reading insurance company rating services reports. Five major insurance rating coAdditional information about life insurance companies can be found by reading insurance company rating services reports.  Five major insurance rating companies grade insurers on their financial health and ability to pay claims.  These companies are:    A.M. Best — www.ambest.com    Standard and Poor’s — www.standardandpoors.com  Moody’s Investor Service — www.moodys.com   Duff & Phelps —   www.duffandphelps.com    Weiss Research — www.weissrating.com  You should check two or three of these services to get a good look at the company’s condition.  They can usually be found in your local library. The California Insurance Code Specific requirements are imposed on agents and insurers when a life insurance policy or annuity replacement or change is proposed.  Some of these rules are as follows: The agent must leave with the applicant an original or copy of all printed materials used for the presentation to the applicant.  CIC 10509.4. (b)(2)The replacing insurer may request the existing insurer to furnish it with a copy of the summaries or ledger statement, within five working days of the receipt of the request.  CIC 10509.6 Every life insurer that uses an agent in a life insurance or annuity sale shall require with or as part of each completed application for life insurance or annuity, a statement signed by the agent as to whether he or she knows replacement is or may be involved in the transaction.  CIC 10509.6. (a)An agent or insurer may not recommend replacement or certain changes to a policy using materially inaccurate presentations or comparisons of an existing contract’s premiums and benefits or dividends and values, if any, or recommends that an insured 65 years of age or older purchase an unnecessary replacement annuity.  CIC 10509.8.A life insurer shall provide to all prospective insureds a buyer’s guide prior to accepting the applicant’s initial premium or premium deposit.  However, if the policy for which application is made contains an unconditional refund provision of at least 10 days, the buyer’s guide shall be delivered with the policy or prior to delivery of the policy.  CIC 10509.975. Every policy of individual life insurance shall have a notice stating that after receipt of the policy by the owner, the policy may be returned by the owner for cancellation by delivering it or mailing it to the insurer or to the agent through whom it was purchased.  This period shall not be less than 10 days nor more than 30 days.  CIC 10127.9.  Senior citizens must be given a notice printed on or attached to the policy indicating a period of no less than 30 days for an individual life insurance and individual annuity contract after receipt of the policy by the owner, the policy may be returned by the owner for cancellation and a full refund.  CIC 10127.10. (a).  Discuss the free look period with your agent or insurer before purchasing a life insurance policy.  If the transaction involves a replacement policy the replacing insurer shall provide in its policy or in a separate written notice which is delivered with the policy that the applicant has a right to an unconditional refund of all premiums paid within a period of 30 days commencing from the date of delivery of the policy.  CIC 10509.6. (d).  \nBack to Top\nBeware of Any Agent Who...\nSuggests that using the cash value from your current policy to fund the premiums on a new policy offers a demonstrable advantage to you, Advises you not to speak to anyone from your current insurer about a policy replacement or change he/she is proposing, Asks you to sign incomplete or blank forms, or Speaks negatively about another agent or company. Your best defense against an ill-advised replacementor change to your life insurance policy or  annuity is knowledge.  The more you know and understand about your current policy and the proposed new policy, as well as the company and the representative, the better equipped you will be to make the best decision.  Remember, if you intend to replace or change an existing coverage, you should be sure that the agent selling the new policy has your best interests at heart, and bases the purchase recommendation on an appropriate needs  analysis.  Agents have a duty to inquire about your current coverage.  Once on notice, the regulatory steps designed to protect you should occur.\nBack to Top\nShopping Tips\nPurchasing the right insurance that meets your needs can be challenging.  Insurance can be one of the most important ongoing purchases you make to protect yourself and your family from financial hardship.  Since your needs and financial situation change over time, it is important to understand and review your insurance policies to decide if the same policies are still right for you.  If you are considering buying, reviewing, or replacing insurance, then the following insurance tips can be of assistance:Verify status of the agent and insurance company (call the California Department of Insurance toll-free at 1-800 927-4357). Never be pressured or intimidated by an agent.Answer all questions on the application correctly.Never sign an incomplete or blank form, or anything you don’t understand. • Compare policies or contracts carefully.Always read your policy or contract.Keep your policy or contract in a safe place.Seniors shopping for annuities should also order or view the informational guides:  Annuities: What Seniors Need to Know and Informing Seniors/Senior Insurance Bill of Rights.\n\n The Department of Insurance cannot make recommendations concerning life insurance or annuity products.  However, you may contact the CDI for informational guides on all types of insurance such as Auto, Home, Life, Annuities, and Health. The CDI can assist you with any insurance question, concern, or problem.  You can reach us toll-free at 1-800-927-4357 or www.insurance.ca.gov. This guide is intended to address some of the more common issues faced by consumers when making life insurance decisions.  However, it does not address all the issues which may affect someone intending to purchase, replace, or change a life insurance policy or annuity. \nBack to Top\nGlossary of Terms\nAccelerated Benefit Provision — A provision in many new policies which will allow the policy owner to receive a portion of the death benefit early if the insured person is diagnosed with a terminal illness or permanently confined to a nursing home. Accidental Death Benefit — A rider added to a policy that provides an additional benefit if the insured dies from accidental causes.Accumulation Phase — The phase in which you pay into your annuity. Annuitization Phase — The phase in which you receive monthly payment from your annuity.  Basis Points — The fees in your annuity; reflects a percentage of your investment.  Certificate — A document provided to a person insured under a group insurance policy that provides evidence that the coverage exists.Death Benefit — The amount of money your beneficiary receives if you die before you begin the annuitization phase; generally the value of your annuity or the amount you have invested, whichever sum is greater.    Evidence of Insurability — Medical and other information about a person applying for insurance that the life insurance company keeps confidential, but uses to decide whether the policy can be issued and what premiums will be charged.\nFace Amount — The amount to be paid to the beneficiary when the insured dies.  It will be reduced by any unpaid policy loans and interest on those loans, and may be increased by any dividends.Free Look — The right of the policyowner to have a period of ten or more days to examine an insurance policy and, if not satisfied, return it to the company for a full refund of all amounts paid.Grace Period — A period of time (usually 31 days) after the premium due date when an overdue premium may be paid without penalty.  The policy remains in force throughout the period.Guaranteed Insurability — An option that permits the policyholder to buy additional stated amounts of life insurance at certain times in the future, without having to provide new evidence of insurability.\nBack to Top\nIllustration — A document used in life insurance sales presentations showing year-by-year numbers indicating how a policy will work.  Usually it assumes that amounts being paid today will continue in all future years.Insured — The person whose life is covered by a life insurance policy; the policyowner; the policyholder.Lapse — The discontinuation of insurance without cash value when the required premium is not paid.  If cash value exists, there may be nonforfeiture provisions available.Loan Value — The amount which can be borrowed by the policyowner from the company using the value of the policy as collateral.  Usually the interest rate payable on the loan varies based on an index defined in the policy.Mode of Premium Payment — The frequency of premium payments during the policy year.  Premium payments can usually be made on annual, semi-annual, quarterly, or monthly mode.Mortality and Expense (M&E) — The fee the insurance company charges you to provide you with a lifetime income, and your beneficiaries with a death benefit should you die during the accumulation phase.  Mortality Table — A statistical table showing the death rate (probability of death) for each age.Nonforfeiture Options — A provision in the policy that allows the policyowner to choose how the cash value of the policy will be used if the policy is surrendered or lapses due to nonpayment of premium.Non-Qualified Annuity — An annuity that is funded with after-tax dollars.Ownership — All rights, benefits, and privileges under a policy controlled by the owner, who is usually the insured. Ownership may be transferred or assigned to someone else by written request of the current owner.Paid-Up Insurance — A life insurance policy where all premiums have already been paid, with no further premium payment due.Participating Insurance — Insurance on which the policyowner is entitled to share in the surplus earnings of the company through dividends, which reflect the difference between the premium charged and the actual earnings and costs of providing coverage.Policy — The printed document issued to the policyowner by the company stating the terms of the insurance contract.Policy Year — A one-year period starting on the day and the month the policy was issued.  The first policy year starts on the date of issue, and ends on the day before the policy’s first anniversary date.Premium — The payment a policyowner is required to make to an insurance company to purchase insurance coverage and to keep the policy in force.Qualified Annuity — Annuity that is funded with pre-tax dollars. \nBack to Top\nRated Policy — A policy issued with an additional premium to cover the extra risk involved if an insured has impaired health, a hazardous occupation or hobby, or is a private pilot.Reinstatement — The restoring of a lapsed or surrendered policy to full force and effect.  The company requires evidence of insurability and payment of all amounts necessary, including interest, to put the policy into the condition it would have been in had the lapse or surrender not occurred.  The company is not obligated to reinstate a policy.Rider — A provision added to a policy that provides additional benefits, usually accompanied by a corresponding premium increase or change.Settlement Option — The manner in which the insured or beneficiary may choose to have the policy proceeds paid.Suicide Clause — A policy provision which reduces or eliminates the amount to be paid if the insured dies from suicide within the first two policy years.Standard Risk — The classification of an applicant for a life insurance policy who fulfills the physical, occupational, and other requirements on which most of the company’s policies are issued.  Someone whose characteristics are more favorable may be classified as a “Preferred Risk.”  When the characteristics are less favorable, the applicant may be characterized as “Rated” or refused coverage altogether.Surrender — To voluntarily terminate or cancel a policy or the act of getting out of your annuity for its cash value or other nonforfeiture options. Usually a fee is applied if you surrender your insurance policy or annuity within the first seven or eight years of owning it.  Tax Deferral — The money that accumulates in your annuity grows tax-deferred, meaning you do not pay taxes on it until you begin receiving annuity payments.  Term Certain Annuity — An annuity that provides you with income payments for a specific period of time, such as 10 or 20 years, rather than a lifetime. Underwriting — The process of evaluating applicants for insurance and classifying them fairly, so the appropriate premium rate may be charged.  This may involve a physical examination of the applicant.Waiver of Premium — A rider added to policy that will waive the premium payments required by an insured during the total disability of the insured.\n Resumen en Español Seguros de vida y AnualidadesEsta página ofrece una visión general de los temas tratados en este folleto.Definir sus necesidadesSeguro de vidaComo elegir la cantidad de seguro de vidaPasos para determinar cuánto seguro de vida necesitaComo elegir el tipo adecuado de seguro de vidaPuntos importantes si usted está considerando cambios a su póliza de seguro de vida Anualidades Anualidades diferidasComo elegir el tipo de anualidad diferidaComo encontrar una buena compra Si usted planea comprar una póliza de seguro de vida o un contrato de anualidad, este folleto le ayudará a entender los diferentes tipos de pólizas de seguros de vida y contratos de anualidades que están disponibles. Para consultar la versión en Español de este folleto, visite www.insurance.ca.gov. Encuentre al consumidor/tipos de seguros.  Talk to Us\nDo you have a question, comment or concern?\nThere are several ways to talk to us:\n\nCall our Consumer Hotline at (800) 927-HELP  Telecommunication Device for the Deaf dial  TTY (800) 482-4833Telephone lines are open 8:00 AM to 6:00 PM Pacific Time, Monday through Friday, excluding holidayWrite:   California Department of  Insurance  300 South Spring St., South Tower  Los Angeles, CA 90013Visit us in person on the 9th Floor at the address above.  Office Hours: Monday through Friday 8:00 AM to 5:00 PM Pacific Time, excluding holidays. \nBack to Top\n\n\n\n\n\n\n\n\n\n\n\n\nConsumers\n\nFile a Complaint\n\nCheck License Status\n\nTypes of Insurance\nAutomobileHomeowner/ResidentialLife And AnnuityLong-Term CareMedicare SupplementPetTNC RidesharingWorkers' CompensationCompare PremiumsInformation Guides\n\nHealth Insurance Information\n\nCompany and Agent/Broker Information\n\nLaws & Regulations\n\nVirtual Viewing Room\n\nDealing with Catastrophes\n\nAdministrative Hearings and Public Programs\n\nCannabis and Insurance\n\nBail Bonds\n\nClimate Change\n\nInformation Guides\n\nWildfire Response and Readiness\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\nADA Compliance\nSite Map\nCareer Opportunities\nInternships\nFree Document Readers\nScheduled Site Maintenance\n\n\nCopyright © California Department of Insurance\n\n\n \n\n Google™ Translation Disclaimer\nX\nThis Google™ translation feature is provided for informational purposes only.\nThe Department of Insurance is unable to guarantee the accuracy of this translation and is therefore not liable for any inaccurate information resulting from the translation application tool.\nThe Department of Insurance is also unable to guarantee the same page layout for all the languages. Depending on the languages, the page layout may look strange from the original.\nPlease consult with a translator for accuracy if you are relying on the translation or are using this site for official business.\nA copy of this disclaimer can also be found on our Disclaimer page.\nSelect a Language Below / Seleccione el Idioma Abajo\n\n\nClose this box or use the [X]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.sfbli.com/",
        "raw_text": "\n\n\n\n\n\n\n\n\n\nHome - Southern Farm Bureau Life Insurance\n\n\nUh-Oh!\n×\nYour session timed out.\r\n                    \n\nLogin\nCalculator\nFind Agent\nReport Claim\nCareers\n\n\n\n\n\n\nAbout UsBlogs  ProductsServicesMy PoliciesPay OnlineLogin\n\n\n\n\n\n\n\n\nOur Mission is to be the life insurance company of choice for our Farm Bureau family. Our focus is to provide competitive products and superior customer service to our Farm Bureau policyholders and agents while observing the highest ethical standards.\nUseful Links ServicesAbout UsBLOGSCareersContact Us\nFind an AgentMy ProfileVariable ReportsHealth PlanBehavioral Health Plan\nCorporate InfoPhone: 601-981-7422Death Claims: 1-800-562-0919Policy Service: 1-800-457-96111401 Livingston Lane \nJackson, MS 39213\n2024 © All Rights Reserved\nPrivacy Policy\nTerms of Use\n\r\n    An unhandled error has occurred.\r\n    Reload\n🗙\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
]